[
    {
        "titulo": "Sistema de apresentação de dados da doença de Parkinson",
        "autor": "Costa, Lucas Moreira",
        "orientador": "Oliveira, Fábio Henrique Monteiro (Orient.)",
        "coorientador": "",
        "ano": "2022",
        "curso": "Tecnologia em Sistemas para Internet",
        "instituicao": "Instituto Federal de Brasília - Campus Brasília",
        "palavras_chave": "Visualização de dados; Doença de Parkinson; Tecnologias vestíveis; Sistema web",
        "resumo": "Com o avanço da tecnologia e o ganho de popularidade da internet das coisas, do inglês Internet of Things (IoT), o uso de sensores inerciais para o acompanhamento do andamento dos sintomas da doença de Parkinson (DP) e a avaliação do tratamento medicamentoso, tem se tornado objeto de estudo de muitos pesquisadores. No entanto, percebe-se uma falta de estudos que visam construir sistemas que permitam uma melhor visualização dos dados coletados por esses sensores inerciais, e consequentemente, a análise das coletas feitas sofre com a falta de ferramentas que auxiliem este processo. Nesse cenário, o presente trabalho teve foco na construção de um painel web para visualização de dados coletados por sensores inerciais de indivíduos acometidos pela DP. Para isso, foi feita inicialmente uma revisão da literatura para a contextualização de como estavam o andamento das pesquisas e estudos a respeito do uso de sensores inercias aplicados à DP. Em seguida, foi construído um protótipo do módulo que foi validado em reuniões semanais com o Grupo de Pesquisa em Computação Aplicada (GPCA). Após isso, deu-se início ao desenvolvimento do sistema que contou com uma camada de apresentação desenvolvida em Javascript, uma interface de programação de aplicativos, do inglês Application Programming Interface (API) desenvolvida em Python, e a integração do Sistema Integrado de Dados Biomédicos (SIDABI), que foi utilizado como banco de dados do sistema. Depois disso, o sistema foi entregue através da computação em nuvem e foi disponibilizado no ambiente web. O módulo desenvolvido contou com 3 telas principais, (I) escolha de perspectiva, UPDRS ou coleta de sensor, (II) lista de pacientes e (III) painel da coleta de sensor. Por fim, o sistema foi submetido a uma sessão de auditoria realizado pela ferramenta Google Lighthouse e também foi apresentado a uma doutoranda em engenharia biómedica que trabalha com sensores inerciais aplicados à DP. Na sessão de auditoria, foram calculadas 4 métricas: Perfomance, Accessibility, Best Practices, Search Engine Optimisation, que poderiam variar de 0 a 100, para cada uma das 3 telas. Na métrica Performance o sistema obteve uma média de 67,6 pontos; Na Accessibility 87,3 pontos; Best Practices 92 pontos; e Search Engine Optimisation 80 pontos.",
        "abstract": "",
        "link_acesso": "https://bdtcbra.omeka.net/items/show/803",
        "arquivo_pdf": "",
        "tipo_trabalho": "TCC"
    },
    {
        "titulo": "Plataforma de apoio à segurança cibernética para professores: PASCIP",
        "autor": "Souza, Rickson Queiroz Marques de",
        "orientador": "Bonfim, Cristiane Jorge de Lima (Orient.)",
        "coorientador": "",
        "ano": "2021",
        "curso": "Tecnologia em Sistemas para Internet",
        "instituicao": "Instituto Federal de Brasília - Campus Brasília",
        "palavras_chave": "Segurança cibernética; Privacidade; Internet; Ensino à distância",
        "resumo": "O cenário da pandemia ocasionada pela COVID-19, bem como a evolução da tecnologia apresentaram situações que exigiram mudanças notáveis para a sociedade em várias áreas, inclusive no âmbito da educação. Diante deste cenário, a segurança cibernética foi fragilizada e um dos principais grupos atingidos é o de professores, que tiveram que ministrar aulas online e encontrar novas formas de apresentar os conteúdos, buscados na internet e que diversas vezes e por falta de conhecimento ou hábito, acabam por não tomar as medidas necessárias de segurança para navegação segura e por consequência, têm a segurança de seus dispositivos comprometida, o que pode trazer diversos transtornos e até mesmo riscos à sua integridade pessoal em meio virtual. Dessa forma, este estudo apresenta uma proposta de geração de conhecimento em segurança cibernética voltada especificamente para os professores, para que eles tenham discernimento ao utilizar tecnologias virtuais, adotando medidas e comportamentos adequados de forma a assegurar a segurança no contexto de dispositivos pessoais conectados à internet, através do letramento digital. Para se chegar ao objetivo foi feito um levantamento bibliográfico e também utilizou-se a pesquisa documental para explorar as fontes primária. Busca-se resolver com o produto oriundo deste trabalho mitigar a problemática atual de segurança cibernética, alcançando um número satisfatório de usuários bem como melhorar substancialmente a segurança online dos mesmos usuários.",
        "abstract": "",
        "link_acesso": "https://bdtcbra.omeka.net/items/show/445",
        "arquivo_pdf": "",
        "tipo_trabalho": "TCC"
    },
    {
        "titulo": "Agenda online de atendimento ao estudante",
        "autor": "Luna, Davi Soares",
        "orientador": "Goulart, Ione Ferrarini (Orient.)",
        "coorientador": "",
        "ano": "2023",
        "curso": "Tecnologia em Sistemas para Internet",
        "instituicao": "Instituto Federal de Brasília - Campus Brasília",
        "palavras_chave": "Estudante; Agenda online; Organização",
        "resumo": "O atendimento ao estudante é um benefício que todos do IFB tem para si, pois ele auxilia no esclarecimento de dúvidas e no contato escolar entre estudante e docente. Ele funciona de forma presencial ou online e nesse horário reservado pelo docente, o estudante pode perguntar e dialogar sobre os demais assuntos necessitados. Esse atendimento não tem um formato padrão e nem um horário específico, o que acaba tornando a sua organização um pouco confusa. Um agendamento eficaz acaba sendo a resposta mais rápida e eficiente para a resolução desse problema, pois o agendamento auxilia tanto os estudantes, quanto os docentes na questão de perda de horário, de omissão de eventos e de uma organização geral do contato entre o estudante e o docente. Diante disso, este presente trabalho propõe o desenvolvimento de um sistema web, em modelo de agenda, como uma ferramenta de organização do atendimento ao estudante e também promovendo uma melhora na comunicação entre ele e o docente.",
        "abstract": "",
        "link_acesso": "https://bdtcbra.omeka.net/items/show/1035",
        "arquivo_pdf": "",
        "tipo_trabalho": "TCC"
    },
    {
        "titulo": "BoaCompra: ferramenta para a realização de vendas online",
        "autor": "Izabel, José Augusto Chaves; Silva, Lucas Mateus",
        "orientador": "Silva, Jefferson Pereira da (Orient.)",
        "coorientador": "",
        "ano": "2021",
        "curso": "Tecnologia em Sistemas para Internet",
        "instituicao": "Instituto Federal de Brasília - Campus Brasília",
        "palavras_chave": "E-commerce; Varejo; Comércio; Vendas",
        "resumo": "Este trabalho apresenta informações sobre o desenvolvimento de um e-commerce, ferramenta de vendas online disponibilizada totalmente na web, que pode auxiliar empreendedores e possíveis comerciantes que tenham interesse em migrar seus negócios ou criar um negócio virtual. Também apresentados alguns problemas que podem ocorrer ao realizar o uso de ferramentas de vendas online. Serão apresentados os passos no desenvolvimento de um e-commerce e sua implementação. Ao final, é exposto um e-commerce que ajuda comerciantes e empreendedores a visualizar o funcionamento de uma ferramenta de vendas na web e como funciona sua implementação. É apresentado ferramentas semelhantes ao BoaCompra com seus pontos positivos e negativos para que os interessados possam comparar qual ferramenta está mais próxima de atender os requisitos necessários para o seu plano de negócio no qual vai implementar o e-commerce. Sobre a metodologia utilizada na realização do trabalho foi desenvolvido uma coleta de dados para o levantamento dos requisitos funcionais e não funcionais do sistema, junto ao stakeholder, uma comerciante de sapatos de pequeno porte, que realiza suas vendas por meio de redes sociais em contato direto com o cliente final, para a construção da ferramenta e estruturar a pesquisa, com os trabalhos correlacionados, tecnologias desenvolvidas e referencias. O resultado foi o desenvolvimento da aplicação web atendendo aos requisitos que foram coletados na análise de requisitos, tornando disponível uma ferramenta em produção no ambiente de teste para utilização e validação do stakeholder.",
        "abstract": "",
        "link_acesso": "https://bdtcbra.omeka.net/items/show/529",
        "arquivo_pdf": "",
        "tipo_trabalho": "TCC"
    },
    {
        "titulo": "Mineração de texto no Twitter: um instrumento para detecção de epidemias",
        "autor": "Simões, Maria Denise",
        "orientador": "Neves, Ana Régia de Mendonça (Orient.)",
        "coorientador": "",
        "ano": "2021",
        "curso": "Tecnologia em Sistemas para Internet",
        "instituicao": "Instituto Federal de Brasília - Campus Brasília",
        "palavras_chave": "Inteligência artificial; Twitter; Covid-19; Mineração de dados; Mineração de texto; Predição",
        "resumo": "A COVID-19 é uma doença respiratória aguda, que pode tornar-se grave, causada por um coronavírus, que surgiu na Ásia, no final de 2019, sendo identificado como SARS-CoV-2. A doença foi relatada inicialmente em Wuhan, China e disseminou-se por diversos países. Em 11 de março de 2020, a Organização Mundial da Saúde - OMS declarou o estado de pandemia de COVID-19. A detecção de um surto da doença em sua fase inicial facilitaria uma ação oportuna que poderia reduzir sua propagação. No Brasil, o sistema SIVEP-Gripe coleta dados de diagnóstico de forma manual, resultando em atrasos em ações de contenção. Redes Sociais, como o Twitter que funcionam com postagens em tempo real, conferem a si um grande banco de registros de casos efetivos de usuários, tornando-as fontes para a constatação antecipada de um surto epidêmico. O objetivo deste artigo é realizar mineração de texto na rede social Twitter, a fim de analisar a tendência epidemiológica de uma série temporal dos dados sobre COVID-19 no Brasil, testando a hipótese de que o monitoramento em redes sociais pode auxiliar na detecção e propagação de epidemias. Os resultados quantitativos da pesquisa confirmam a hipótese em questão quando comparados aos dados dos agentes notificadores no Brasil, Ministério da Saúde e Fundação Oswaldo Cruz-FIOCRUZ, e da Organização Mundial da Saúde - OMS, como explicita a Seção 4 deste trabalho.",
        "abstract": "",
        "link_acesso": "https://bdtcbra.omeka.net/items/show/537",
        "arquivo_pdf": "",
        "tipo_trabalho": "TCC"
    },
    {
        "titulo": "ClickFood: um sistema para recomendação de receitas culinárias",
        "autor": "Santos, Aurélio Vinicius França dos; Silva, Hugo César Alves da",
        "orientador": "Barros, Heitor José dos Santos (Orient.)",
        "coorientador": "",
        "ano": "2021",
        "curso": "Tecnologia em Sistemas para Internet",
        "instituicao": "Instituto Federal de Brasília - Campus Brasília",
        "palavras_chave": "Culinária; Receitas; Sistema web",
        "resumo": "Ao longo da história a humanidade sempre desenvolveu diferentes relações com seu alimento, acumulando os conhecimentos culinários em receitas. Assim, milhares de receitas diferentes se acumularam ao longo do tempo ao redor do mundo e com o avanço da tecnologia muitas dessas receitas passam a estar disponíveis na internet. Entretanto, o grande número de receitas aliadas a uma diversidade de ingredientes possíveis faz com que o processo de encontrar uma nova receita possa ser demorado e frustrante. Assim, o ClickFood surge, então, como uma alternativa tecnológica para ajudar na busca por receitas. O objetivo é fazer uma busca de receitas a partir dos ingredientes que o usuário seleciona na página do sistema, otimizando o tempo de busca e o uso de ingredientes do usuário. Utilizando ferramentas e tecnologias aprendidas ao longo do curso de Sistemas para Internet, o ClickFood está disponível na web e traz uma busca de receitas baseada nos ingredientes que o usuário seleciona. Através da pesquisa de opinião e testes com usuários o sistema se mostrou eficiente com alto grau de aceitação para usabilidade no dia a dia alcançando seu propósito.",
        "abstract": "",
        "link_acesso": "https://bdtcbra.omeka.net/items/show/540",
        "arquivo_pdf": "",
        "tipo_trabalho": "TCC"
    },
    {
        "titulo": "Sistema de apoio e acompanhamento de trabalhos de conclusão de curso",
        "autor": "Franco, Almir José Malheiros; Nunes, Guilherme Jesus",
        "orientador": "Deus, Gustavo Henrique Dornelas de (Orient.); Lima, Daniel Sundfeld (Coorient.)",
        "coorientador": "",
        "ano": "2022",
        "curso": "Tecnologia em Sistemas para Internet",
        "instituicao": "Instituto Federal de Brasília - Campus Brasília",
        "palavras_chave": "Graduação; Orientação acadêmica; Trabalho de conclusão de curso.",
        "resumo": "O trabalho de conclusão de curso é um item obrigatório em cursos de graduação superior, sendo imprescindível que o aluno produza o trabalho sob a orientação de pelo menos um professor, referencialmente especialista no assunto escolhido, que norteie a linha de desenvolvimento que a pesquisa deve seguir. Ao mesmo tempo em que a escolha de tema e orientador são passos importantes para iniciar o trabalho de conclusão de curso, o que implica em coletar, organizar e analisar informações da maneira mais objetiva possível dentro de um vasto universo de possibilidades de modo a evitar que o tempo gasto nessa fase seja longo demais tendo em vista todo o cronograma de atividades pela frente. Este projeto teve a concepção de um sistema que centraliza e disponibiliza informações sobre TCC’s, orientadores e orientandos, do curso de Tecnologia em Sistemas para Internet (TSI) no Instituto Federal de Brasília (IFB). A metodologia aplicada através do estudo de caso e análise de conteúdo por meio de outros trabalhos semelhantes contribuíram para a averiguação da aplicação prática do objeto de estudo em outros institutos universitários de acordo com suas peculiaridades. Para que fossem alcançados os objetivos propostos, foi realizado um cronograma seguindo as etapas de levantamento de requisitos, modelagem e desenvolvimento do sistema resultando em uma aplicação web construída com a tecnologia Angular, na interface visual, e do Node.js, na criação do backend, em conjunto com o framework Express.js para a realização de operações com o banco de dados não relacional MongoDB. O produto deste trabalho contribui para a organização e otimização do tempo, sobretudo, na fase inicial do TCC provendo informação de fácil acesso com o intuito de apoiar os estudantes na identificação de temas e orientadores e fornecer aos professores uma ferramenta para o acompanhamento dos trabalhos em desenvolvimento.",
        "abstract": "",
        "link_acesso": "https://bdtcbra.omeka.net/items/show/775",
        "arquivo_pdf": "",
        "tipo_trabalho": "TCC"
    },
    {
        "titulo": "MaGeo Quiz Gamificado: uma nova forma de aprender geometria plana",
        "autor": "Silva, Emanuelle Ferreira da",
        "orientador": "Bonfim, Cristiane Jorge de Lima (Orient.)",
        "coorientador": "",
        "ano": "2021",
        "curso": "Tecnologia em Sistemas para Internet",
        "instituicao": "Instituto Federal de Brasília - Campus Brasília",
        "palavras_chave": "Quiz; Gamificação; Ensino; Aprendizagem; Geometria plana",
        "resumo": "A educação básica é essencial na formação acadêmica de um estudante. O ensino da geometria nas escolas brasileiras, trouxe muitas mudanças ao longo dos anos, preocupando-se diretamente com os resultados das notas das avaliações, do que com o ensino e a aprendizagem dos estudantes. Este presente projeto tem como objetivo desenvolver uma plataforma educacional gamificada aplicada ao ensino de Geometria Plana para apoiar a aprendizagem dos estudantes do ensino médio integrado. Foi realizada a definição do problema por meio de uma entrevista com as professoras especialistas na área de matemática do Ensino Médio Integrado do Campus Brasília em consonância com a metodologia DBR (Design Based Research). No levantamento de requisitos foi aplicado um questionário para os estudantes do Ensino Médio Integrado do IFB, com o desígnio de entender o que causa o desinteresse e o baixo desempenho dos estudantes, além de identificar a metodologia e a plataforma que auxilie no ensino do conteúdo de Geometria Plana. O Quiz Gamificado foi desenvolvido e aplicado por meio de uma reunião assíncrona realizada com os estudantes. No final, após as reuniões de validação com as professoras especialistas que aprovaram a plataforma, o sistema obteve uma porcentagem 85,7% do interesse dos estudantes em aprender o conteúdo com o quiz demonstrando um resultado promissor.",
        "abstract": "",
        "link_acesso": "https://bdtcbra.omeka.net/items/show/428",
        "arquivo_pdf": "",
        "tipo_trabalho": "TCC"
    },
    {
        "titulo": "SEBAS: tecnologia à serviço da infraestrutura da região administrativa de São Sebastião do DF: RA XIV",
        "autor": "Fontenele, Guilherme Lucas Matos",
        "orientador": "Sanches, Henderson Matsuura (Orient.)",
        "coorientador": "",
        "ano": "2021",
        "curso": "Tecnologia em Sistemas para Internet",
        "instituicao": "Instituto Federal de Brasília - Campus Brasília",
        "palavras_chave": "Geolocalização; Levantamento de requisitos; Região Administrativa de São Sebastião; Governo do Distrito Federal (GDF)",
        "resumo": "Com o crescimento populacional da Região Administrativas de São Sebastião (RA XIV) do Distrito Federal que está cada dia maior, vai aparecendo problemas estruturais, que precisam ser solucionados, problemas que vão de erosões a falta de saneamento básico e energia adequadas, e falta de manutenção nos monumentos históricos das Regiões Administrativas. O objetivo deste trabalho é realizar o levantamento de requisitos para o desenvolvimento de uma futura aplicação com Geolocalização em Tempo Real, no qual o Governo do Distrito Federal (GDF) pode utilizar para realizar a manutenção da RA XVI. A metodologia utilizada foi a Unified Modeling Language (UML) e o Scrum.",
        "abstract": "",
        "link_acesso": "https://bdtcbra.omeka.net/items/show/532",
        "arquivo_pdf": "",
        "tipo_trabalho": "TCC"
    },
    {
        "titulo": "Geomagia: jogo educacional para ensino do cilindro em geometria espacial no ensino médio",
        "autor": "Sena, Luan de Sousa",
        "orientador": "Bonfim, Cristiane Jorge de Lima (Orient.)",
        "coorientador": "",
        "ano": "2021",
        "curso": "Tecnologia em Sistemas para Internet",
        "instituicao": "Instituto Federal de Brasília - Campus Brasília",
        "palavras_chave": "Jogo educacional; Aprendizagem; Geometria espacial; Gamificação",
        "resumo": "Geometria Espacial é o estudo das formas geométricas tridimensionais como cilindros, cones e esferas, sendo portanto um conteúdo que requer níveis de abstração por parte do estudante, uma vez que estas formas geométricas são por si só objetos tridimensionais. Sendo assim, o objetivo geral do presente trabalho é desenvolver um Jogo Educacional para apoiar a aprendizagem ensino médio do conteúdo de Cilindro em geometria espacial de uma forma engajadora. A metodologia utilizada para desenvolvimento do jogo foi a DBR, ou Design Based Research, para acompanhamento no contexto das etapas da engenharia de software. O referencial teórico focou na busca de estilos de aprendizagem no ensino médio e o uso de Jogos Educacionais no ensino de geometria. Os resultados da avaliação do jogo educacional Geomagia pelas professoras especialistas mostrou que elas estavam satisfeitas com o produto e que pode ajudar os estudantes a aplicarem seus conhecimentos em geometria espacial no conteúdo do cilindro.",
        "abstract": "",
        "link_acesso": "https://bdtcbra.omeka.net/items/show/430",
        "arquivo_pdf": "",
        "tipo_trabalho": "TCC"
    },
    {
        "titulo": "Inteligência de negócios e aprendizado de máquina aplicado no WooCommerce",
        "autor": "Calisto, Guilherme Marcal",
        "orientador": "Fernandez, Fábio Ferraz (Orient.)",
        "coorientador": "",
        "ano": "2023",
        "curso": "Tecnologia em Sistemas para Internet",
        "instituicao": "Instituto Federal de Brasília - Campus Brasília",
        "palavras_chave": "Relacionamento com cliente; Tráfego pago; WooCommerce; Aprendizado de máquina",
        "resumo": "Investir em tráfego paga - pagar algum sistema indexador ou rede social, como Google ou Facebook, para levar os usuários para o seu site - se tornou prática comum para empreendedores digitais. Essa prática é benéfica ao negócio, uma vez que pode levar a loja usuários que tenham maior afinidade com os produtos ofertados, por consequência, aumenta o número de vendas, taxa de conversão e base de clientes. Pensado nisso, este projeto se propõe a analisar os principais indicadores chave de desempenha do relacionamento cliente-empresa e como esses indicares aliados ferramentas de ciência de dados e aprendizado de máquina podem otimizar os investimentos em marketing. Além da análise dos indicadores, também será produzido uma ferramenta de produza os indicadores estudados, gere uma análise estatística direcionada à otimização dos recursos financeiros da organização e se integre ao que hoje a ferramenta mais utilizada para a criação de lojas online, o WooCommerce, formando-se assim uma ferramenta que poderia atender mais de cinco milhões de usuário.",
        "abstract": "",
        "link_acesso": "https://bdtcbra.omeka.net/items/show/892",
        "arquivo_pdf": "",
        "tipo_trabalho": "TCC"
    },
    {
        "titulo": "Proposta de aplicação da tecnologia Blockchain para sistema de votação",
        "autor": "Santos, Eduardo Schuindt",
        "orientador": "Feres, Marcelo Machado (Orient.)",
        "coorientador": "",
        "ano": "2019",
        "curso": "Tecnologia em Sistemas para Internet",
        "instituicao": "Instituto Federal de Brasília - Campus Brasília",
        "palavras_chave": "Blockchain; Eleição; Processo eleitoral; Eleição digital",
        "resumo": "Este projeto visa à proposição de um protótipo de um sistema online de gestão do processo eleitoral formal, utilizando a tecnologia Blockchain. O protótipo do sistema possibilita o cadastro de eleitores aptos a votar, promover o processo eletrônico de votação e sua apuração. Ele se propõe a ser uma alternativa para os processos eleitorais formais em setores da sociedade que possuem cargos eletivos e realizam eleições que aplicam o modelo tradicional de votação com urnas físicas e voto em cédulas, transformando-as em formato eletrônico com a segurança necessária para garantir a lisura do pleito, com baixo custo de infraestrutura e eficiência e conforto que uma votação eletrônica, pela web, pode oferecer. O processo eletrônico reduz o número de pessoas que são alocadas em mesa de controle de votação e fiscalização. A opção pela tecnologia Blockchain, visa a garantir que todo o processo eleitoral possa ocorrer com segurança, eficiência e garantido o anonimato do eleitor, ainda que o processo se dê pela internet.",
        "abstract": "",
        "link_acesso": "https://bdtcbra.omeka.net/items/show/10",
        "arquivo_pdf": "",
        "tipo_trabalho": "TCC"
    },
    {
        "titulo": "Aplicação das metodologias de Business Intelligence para análise dos dados abertos governamentais do Instituto Federal de Brasília",
        "autor": "Campos, Thiago Marinho da Silva",
        "orientador": "Deus, Gustavo Henrique Dornelas de (Orient.)",
        "coorientador": "",
        "ano": "2021",
        "curso": "Tecnologia em Sistemas para Internet",
        "instituicao": "Instituto Federal de Brasília - Campus Brasília",
        "palavras_chave": "Análise de dados; Business Intelligence; Instituto Federal de Brasília - IFB",
        "resumo": "A sociedade constantemente observa, analisa e interpreta dados e informações em áreas diversas, tanto no âmbito profissional como no pessoal. Nesta linha, este trabalho apresenta uma análise exploratória dos dados abertos do Instituto Federal de Brasília - IFB, tratando informações públicas coletadas do sítio do portal brasileiro de dados abertos, identificando e aplicando estratégias para modelagem de uma proposta de Business Intelligence - BI na avaliação qualitativa dos dados buscando facilitar o entendimento da informação e gerar conhecimento para apoiar tomadas de decisões assertivas. Para tal foi necessário fazer a extração, transformação, carga e modelagem de dados baseados nos conceitos de star schema, utilizando a abordagem bottom-up de Kimball. A metodologia aplicada foi a Design Science Research – DSR, em que os artefatos projetados possuem o propósito de solucionar uma necessidade ou alcançar uma finalidade. Neste projeto foi desenvolvido um dashboard que apresenta dados para mensurar o índice de alunos matriculados, índice de alunos certificados/diplomados e os indicadores de permanência e êxito no IFB, documentando as etapas e apresentando os resultados.",
        "abstract": "",
        "link_acesso": "https://bdtcbra.omeka.net/items/show/530",
        "arquivo_pdf": "",
        "tipo_trabalho": "TCC"
    },
    {
        "titulo": "Guia colaborativo de recomendações técnicas sobre interface de usuário para professores",
        "autor": "Silva, Ludmila Danielle Bianchi da",
        "orientador": "Mombach, Jaline Gonçalves (Orient.)",
        "coorientador": "",
        "ano": "2020",
        "curso": "Tecnologia em Sistemas para Internet",
        "instituicao": "Instituto Federal de Brasília - Campus Brasília",
        "palavras_chave": "Design de interface de usuário; Tecnologia educacional; Educação à distância; Interação humano-computador",
        "resumo": "As discussões sobre a Educação a Distância (EaD) têm crescido nos últimos tempos. No contexto pandêmico de 2020, o assunto recebeu mais visibilidade. O ensino remoto envolve os professores em uma nova prática. Entretanto, não existem guias práticos on-line com diretrizes técnicas sobre Design da Interface do Usuário, voltados aos docentes, que incentivam a criação de materiais educacionais com boa usabilidade e acessibilidade. Assim, este trabalho tem como objetivo revisar a bibliografia e propor a construção de um guia de interface de usuário para professores. Os resultados indicam demanda por esse tipo de material e a possibilidade de inter-relacionar os conceitos de Interface do Usuário com a produção de materiais didáticos para uso digital. Palavras-chave: Design de Interface de Usuário. Tecnologia educacional. Educação a Distância. Interação Humano-Computador (IHC).",
        "abstract": "",
        "link_acesso": "https://bdtcbra.omeka.net/items/show/302",
        "arquivo_pdf": "",
        "tipo_trabalho": "TCC"
    },
    {
        "titulo": "Sistema institucional de presença de aluno",
        "autor": "Muniz, Leonardo Campos",
        "orientador": "Lima, Daniel Sundfeld (Orient.)",
        "coorientador": "",
        "ano": "2021",
        "curso": "Tecnologia em Sistemas para Internet",
        "instituicao": "Instituto Federal de Brasília - Campus Brasília",
        "palavras_chave": "Presença; Evento; Sistema; Controle de presença; Sistema mobile",
        "resumo": "Eventos promovidos no ambiente acadêmico são uma grande forma de integração, expansão curricular e aprendizagem em um ambiente externo ao de sala de aula. Entretanto, um dos grandes empecilhos desta atividade seria o controle e checagem da presença dos alunos no evento. Tendo em vista que os métodos tradicionais que garantem essa verificação sejam trabalhosos, na maioria das vezes são bem caros e dão poucas opções para os organizadores do evento. Este trabalho propõe e avalia o uso de um aplicativo para realizar esta tarefa, como ferramenta de auxílio para professores de todos os níveis de ensino. O aplicativo foi criado, desenvolvido e aplicado em um evento fictício para que não houvesse aglomerações devido a pandemia. O resultado foi satisfatório e mostra que a ferramenta em questão tem potencial para fortalecer os recursos educacionais digitais para o ensino.",
        "abstract": "",
        "link_acesso": "https://bdtcbra.omeka.net/items/show/449",
        "arquivo_pdf": "",
        "tipo_trabalho": "TCC"
    },
    {
        "titulo": "Pimpolho Kids: um jogo digital para alfabetização infantil",
        "autor": "Carvalho, Camila Nascimento de",
        "orientador": "Santos, Sylvana Karla da Silva de Lemos (Orient.); Segato, Tiago Henrique Faccio (Coorient.)",
        "coorientador": "",
        "ano": "2022",
        "curso": "Tecnologia em Sistemas para Internet",
        "instituicao": "Instituto Federal de Brasília - Campus Brasília",
        "palavras_chave": "Alfabetização; Jogo digital; Ensino-aprendizagem; Ludicidade",
        "resumo": "O uso de jogos digitais no ambiente escolar pode despertar o interesse de crianças em etapas de alfabetização. Com o rápido desenvolvimento de novas tecnologias, muitas áreas, a fim de facilitar processos cotidianos, procuram utilizar esses meios. O campo educacional, por ser um espaço multi-interativo, ainda carece de ferramentas didáticas lúdicas que possam prender a atenção dos estudantes, principalmente aqueles dos anos iniciais que, em certos casos, apresentam dificuldades na aprendizagem, seja para reter o conteúdo das disciplinas, como para manter o foco durante as aulas. Posto isso, o presente trabalho visa desenvolver um jogo que possa auxiliar na aprendizagem de estudantes que estão na etapa de alfabetização. Para a produção do projeto foi utilizada a abordagem Design Thinking que tem como foco trazer soluções prototipadas para problemas em evidências. O jogo digital educativo foi desenvolvido e aplicado de forma prática com as crianças em processo de alfabetização de uma escola pública no Distrito Federal. Os resultados indicam interesse das crianças pela proposta. Dessa maneira, o jogo digital educativo, como ferramenta lúdica, poderá colaborar na aprendizagem de crianças que estão no processo de alfabetização.",
        "abstract": "",
        "link_acesso": "https://bdtcbra.omeka.net/items/show/772",
        "arquivo_pdf": "",
        "tipo_trabalho": "TCC"
    },
    {
        "titulo": "Análise de sentimentos dos usuários brasileiros do Twitter com relação ao COVID-19",
        "autor": "Guimarães, Nathália Teixeira",
        "orientador": "Neves, Ana Régia de Mendonça (Orient.)",
        "coorientador": "",
        "ano": "2022",
        "curso": "Tecnologia em Sistemas para Internet",
        "instituicao": "Instituto Federal de Brasília - Campus Brasília",
        "palavras_chave": "Redes sociais; Twitter; Análise de sentimento; Covid-19",
        "resumo": "Em fevereiro de 2020 ocorreu o primeiro caso de contaminação pelo vírus da Covid-19 no Brasil. Com base nisso, o país precisou tomar medidas para a contenção do aumento no diagnóstico positivo de infectados. Ao mesmo tempo, o brasileiro usou as redes sociais como veículo de manifestação do pensamento frente à pandemia e aos acontecimentos que a envolviam. O Twitter foi a mais eficiente plataforma utilizada com esse objetivo. Nesse contexto, este artigo tem como objetivo fazer uma análise de sentimento dos tweets publicados sobre a epidemia da Covid-19 durante o período de 4 de fevereiro a 7 de março de 2021. Para isso, a análise terá como base avaliativa os seis sentimentos básicos de todo ser humano, que foram identificados na tese da teoria dos sentimentos, de Paul Ekman. A técnica Naive Bayes de aprendizado de máquina foi utilizada para o desenvolvimento de dois modelos, um para a classificação de Paul Ekman e outro para a de Polaridade. Um total de 1.651 mil tweets classificados manualmente foram utilizados para o treino e teste dos classificadores. Os resultados demonstraram F1-score de até 0.69 para os tweets negativos da classificação de Polaridade e de 0.67 para os tweets classificados como raiva na classificação de Paul Ekman. Em ambos os modelos, o F1-score foi melhor para as classes em que o número de amostras era maior. Com base na análise de sentimentos realizada, foi possível concluir que o sentimento predominante dos brasileiros com relação à Covid-19 e seus possíveis sintomas no período de 4 de fevereiro a 7 de março de 2021 foi o de raiva.",
        "abstract": "",
        "link_acesso": "https://bdtcbra.omeka.net/items/show/612",
        "arquivo_pdf": "",
        "tipo_trabalho": "TCC"
    },
    {
        "titulo": "Busca de palavras e expressões em livros e artigos com ranqueamento por aparição e relevância",
        "autor": "Alves, Davi Pereira Speck",
        "orientador": "Van der Linden, Marx Gomes",
        "coorientador": "",
        "ano": "2022",
        "curso": "Tecnologia em Sistemas para Internet",
        "instituicao": "Instituto Federal de Brasília - Campus Brasília",
        "palavras_chave": "Resumo; Sumarizar; Eficientizar; Read Optimizer",
        "resumo": "Resumir e sumarizar são dois termos que estão se tornando cada vez mais comuns em todas as áreas de atuação, no qual resumir é de fato compactar um texto da melhor forma possível, enquanto sumarizar é elencar tópicos importantes advindos do mesmo. Assim, tornou-se ainda mais importante entender as técnicas que são capazes de eficientizar ambos. Diante tal realidade, este trabalho tem o intuito de apresentar o software RO (Read Optimizer) de forma teórica e prática, demonstrando o quanto é possível poupar tempo no processo de leitura ao resumir ou sumarizar, isso, claro, sem desvalorizar a qualidade do processo. Dessa forma, o documento em questão é pautado na especificação das etapas de desenvolvimento, indo desde o surgimento da ideia e benchmarking até a experiência do usuário na utilização do programa em uma primeira versão. É importante ressaltar também, que o Read Optimizer não produz o resumo de um texto propriamente dito, ele age mais como uma ferramenta de apoio e direcionamento. Com isso, verificou-se que apesar de existirem outras aplicações sustentadas nos mesmos preceitos, há, no RO, particularidades e vantagens quando se trata da valorização da margem de interpretação por parte do usuário. Por fim, considerando tal constatação, pode-se concluir que para aqueles que procuram por algo mais direto, que realiza uma síntese de forma imediata e totalmente computadorizada, o que já existe no mercado pode satisfazer, mas,entendendo a existência daqueles que necessitam de uma maior precisão no entendimento, há o sistema aqui desenvolvido.",
        "abstract": "",
        "link_acesso": "https://bdtcbra.omeka.net/items/show/780",
        "arquivo_pdf": "",
        "tipo_trabalho": "TCC"
    },
    {
        "titulo": "Gamificação em um sistema de realidade virtual na preservação histórica de informações",
        "autor": "Borges, Leonardo Lopes",
        "orientador": "Deus, Gustavo Henrique Dornelas de (Orient.)",
        "coorientador": "",
        "ano": "2023",
        "curso": "Tecnologia em Sistemas para Internet",
        "instituicao": "Instituto Federal de Brasília - Campus Brasília",
        "palavras_chave": "Preservação da informação; Patrimônio cultural; Gamificação; Software",
        "resumo": "A preservação de dados é uma nova área que surge diante da realidade dos documentos digitais na vida das pessoas e das empresas públicas e privadas, com relação aos patrimônios históricos e culturais, a digitalização das informações e o arquivamento destes permite que a sociedade e as próximas gerações venha a conhecer os sítios através de fotos, dados e vídeos. Neste sentido, o objetivo geral deste projeto é desenvolver recursos de gamificação em um sistema que utiliza realidade virtual na apresentação de imagens em 360o de locais históricos e culturais como meio de instigar a curiosidade dos usuários, trazendo interatividade, dinamismo a uma experiência aprazível. A gamificação é a aplicação das estratégias dos jogos nas atividades do dia a dia, com o objetivo de aumentar o engajamento dos participantes, se baseia no game thinking, conceito que abrange a integração da gamificação com outros saberes do meio corporativo e do design. Em um sistema de preservação histórica são encontradas possíveis formas de práticas de gamificação, com a intenção de ajudar a compreensão e possibilitar melhorias favorecendo a interatividade. Na metodologia empregada neste trabalho, utiliza o Design Based Research (DBR), como parte do processo de dinâmica. Dentro da proposta deste projeto, apresenta-se um cronograma, documentos de requisitos e um diagrama de caso de uso representando as funções do sistema. Nas análise e discussões dos resultados é relatado a experiência do desenvolvimento do software proposto assim como a apresentação das principais funcionalidades elaboradoras e implementadas do sistema. Nas considerações finais mostra-se as conclusões sobre o projeto, limitações e perspectivas de novas pesquisas ou evoluções baseadas nesse trabalho.",
        "abstract": "",
        "link_acesso": "https://bdtcbra.omeka.net/items/show/994",
        "arquivo_pdf": "",
        "tipo_trabalho": "TCC"
    },
    {
        "titulo": "Uso de jogo digital como ferramenta de aprendizagem dos alunos do ensino médio do Instituto Federal de Brasília",
        "autor": "Melo, Marcus Vinícius Cardoso de",
        "orientador": "Segato, Tiago Henrique Faccio (Orient.)",
        "coorientador": "",
        "ano": "2019",
        "curso": "Tecnologia em Sistemas para Internet",
        "instituicao": "Instituto Federal de Brasília - Campus Brasília",
        "palavras_chave": "Estratégia de aprendizagem; Jogo digital; Perfil (jogo de tabuleiro); Recurso educacional digital",
        "resumo": "Uma boa aprendizagem requer interesse e motivação do aluno para aprender. Os métodos tradicionais de aprendizado não parecem suficientes para tal engajamento e por isso os jogos são relevantes estratégias de ensino. Nesse contexto, os jogos didáticos ganham força como instrumento pedagógico para estimular o interesse e a motivação do aluno. Utilizando as novas tecnologias, este trabalho propôs e avaliou o uso de um jogo digital baseado no clássico jogo “Perfil”, como ferramenta de auxílio de aprendizagem para alunos e professores do ensino médio do Instituto Federal de Brasília. O jogo foi criado e aplicado em uma das turmas do instituto. O resultado foi satisfatório e mostra que o jogo tem potencial para fortalecer os recursos educacionais digitais para o ensino básico brasileiro.",
        "abstract": "",
        "link_acesso": "https://bdtcbra.omeka.net/items/show/30",
        "arquivo_pdf": "",
        "tipo_trabalho": "TCC"
    },
    {
        "titulo": "Análise de implementação de sistemas baseados em ITIL na SEEC-DF",
        "autor": "Cunha, Rodrigo Dos Santos Barbosa",
        "orientador": "Fustinoni, Diógenes Ferreira Reis (Orient.)",
        "coorientador": "",
        "ano": "2023",
        "curso": "Tecnologia em Sistemas para Internet",
        "instituicao": "Instituto Federal de Brasília - Campus Brasília",
        "palavras_chave": "Sistemas; Tecnologia da Informação; ITIL; CITSmart; CA SDM",
        "resumo": "Conforme a Tecnologia da Informação foi evoluindo, as organizações passaram a buscar melhorias nos serviços de TI. Com isso as boas práticas vêm se tornando essencial para obter competitividade e alcançar o sucesso desejado. A Secretaria de Economia do Distrito Federal procura através da implementação de um novo sistema de atendimento de chamados baseado nos processos de gerenciamento ITIL um atendimento mais eficiente e estratégico em relação ao antigo sistema . Este trabalho tem o propósito de analisar esta implementação coletando informações geradas pelos sistemas utilizados para este atendimento, comparando ambas ferramentas e verificando a satisfação dos colaboradores e os usuários da secretaria de economia do DF através de relatórios desses sistemas.",
        "abstract": "",
        "link_acesso": "https://bdtcbra.omeka.net/items/show/944",
        "arquivo_pdf": "",
        "tipo_trabalho": "TCC"
    },
    {
        "titulo": "Fabbrini: prontuário eletrônico para sistemas de teleconsultas",
        "autor": "Amaral, Gabriel Aragão do; Godois, Matheus Xavier",
        "orientador": "Segato, Tiago Henrique Faccio (Orient.)",
        "coorientador": "",
        "ano": "2021",
        "curso": "Tecnologia em Sistemas para Internet",
        "instituicao": "Instituto Federal de Brasília - Campus Brasília",
        "palavras_chave": "Prontuário eletrônico; Teleconsultas; Dados de saúde; Aplicação web",
        "resumo": "Na área da saúde, a tecnologia é bastante utilizada nas mais diversas atividades médicas, inclusive em consultas e teleconsultas. O prontuário é tido como uma ferramenta importante para manter os dados de saúde do paciente. Porém, ainda há uso de prontuário em forma de papel, o que causa uma série de problemas por questões de ilegibilidade, fácil deterioração e acúmulo de espaço, gerando altos custos aos utilizadores deste meio. Observando essas fraquezas, este trabalho tem como objetivo o desenvolvimento de um prontuário eletrônico do paciente (PEP) para manutenção de dados de saúde dos pacientes cadastrados no Sistema de Telemedicina Fabbrini. Foram utilizadas tecnologias web para o desenvolvimento da aplicação, o que auxiliará os profissionais na atividade médica de teleconsulta. Tal solução foi implementada e testada sob a colaboração de um profissional da área da saúde e como resultado, se obteve uma avaliação positiva do Prontuário Eletrônico desenvolvido, na realização de atividades médicas no que se trata a manutenção dos dados de saúde dos pacientes.",
        "abstract": "",
        "link_acesso": "https://bdtcbra.omeka.net/items/show/533",
        "arquivo_pdf": "",
        "tipo_trabalho": "TCC"
    },
    {
        "titulo": "Sistema de controle patrimonial de informática",
        "autor": "Alves, Leandro da Silva",
        "orientador": "Van der Linden, Marx Gomes (Orient.)",
        "coorientador": "",
        "ano": "2019",
        "curso": "Tecnologia em Sistemas para Internet",
        "instituicao": "Instituto Federal de Brasília - Campus Brasília",
        "palavras_chave": "Gestão de TI; Armazenamento de dados",
        "resumo": "Este trabalho de conclusão de curso aponta como proposta o desenvolvimento de um sistema que controla o patrimônio de equipamentos de informática, sendo específico para o Instituto de Pesquisa Ambiental da Amazônia (IPAM). O sistema tem como objetivo armazenar dados de equipamentos de informática, adquirindo informações de forma rápida e simples, diminuindo a possibilidade de erros e auxiliando o departamento administrativo na tomada de decisões das atividades rotineiras. Inicialmente o sistema ficará alocado no servidor do instituto, podendo ser acessado através de uma interface com autenticação de usuários e senha devidamente cadastrados. É importante frisar que a ideia para o desenvolvimento deste sistema teve início dentro da equipe de informática da instituição, para trazer qualidade no serviço oferecido, melhorando a busca e inclusão de novos patrimônios. Por fim, todos os objetivos foram alcançados, pois o sistema está em fase de homologação, hospedado em um servidor local e pronto para ser testado por outros escritórios alocados no Brasil.",
        "abstract": "",
        "link_acesso": "https://bdtcbra.omeka.net/items/show/27",
        "arquivo_pdf": "",
        "tipo_trabalho": "TCC"
    },
    {
        "titulo": "Sistema web de suporte à decisão para uma empresa de internet do Distrito Federal",
        "autor": "Reis, Davi Resende Silveira; Leitão, Hariel Levy de Mendonça",
        "orientador": "Queiroz, Diego Cesar Florencio de (Orient.)",
        "coorientador": "",
        "ano": "2023",
        "curso": "Tecnologia em Sistemas para Internet",
        "instituicao": "Instituto Federal de Brasília - Campus Brasília",
        "palavras_chave": "Sistema de suporte a decisão; Análise de dados; Séries temporais; Estimativa de demanda; Programação; Desenvolvimento web",
        "resumo": "A inovação tecnológica tem se mostrado uma força impulsionadora em diversos setores, trazendo consigo uma grande variedade de ferramentas e soluções que impactam positivamente nossas vidas cotidianas. Entre esses setores beneficiados, destaca-se o setor empresarial, onde a tecnologia está transformando a maneira como as empresas operam e se adaptam às demandas do mercado, proporcionando eficiência, competitividade e melhores resultados. Atualmente, a empresa selecionada para o desenvolvimento do projeto, realiza seus investimentos sem muito embasamento, isso acarreta em um investimento mal direcionado, principalmente na compra em lote dos materiais utilizados pela empresa, como cabos e conectores, pois a empresa utiliza materiais específicos para a prestação de serviço dependendo da região, distância, plano escolhido pelo cliente e entre outros fatores, então a compra excessiva de determinado material, ocasiona em um problema recorrente em diversas empresas, o estoque parado. Dessa forma, esse trabalho propõe a aplicação de um sistema web capaz de auxiliar e guiar os gestores da empresa no processo de tomada de decisão, retornando insights sobre o desempenho da empresa, com base no número de novas assinaturas, cancelamentos e faturamentos que a empresa teve, através de gráficos interativos e intuitivos, visando praticidade e facilidade no uso, com o objetivo de proporcionar uma ferramenta capaz de auxiliar a empresa em seus investimentos.",
        "abstract": "",
        "link_acesso": "https://bdtcbra.omeka.net/items/show/1002",
        "arquivo_pdf": "",
        "tipo_trabalho": "TCC"
    },
    {
        "titulo": "Software de automatização de controle de processos em um ambiente jurídico",
        "autor": "Sallenave, Caio Nathan Gomes",
        "orientador": "César, Hugo Do Carmo Mendes (Orient.); Daoud, Caio Moura (Coorient.)",
        "coorientador": "",
        "ano": "2020",
        "curso": "Tecnologia em Sistemas para Internet",
        "instituicao": "Instituto Federal de Brasília - Campus Brasília",
        "palavras_chave": "Banco de dados; SGBD; Automatização; Armazenamento de dados; Escritório de advocacia",
        "resumo": "Atualmente é possível observar que a tecnologia propõe soluções para os problemas encontrados na sociedade. Com a disseminação das inovações tecnológicas tem-se a presença de computadores nas mais diversas camadas sociais, fato que proporciona o armazenamento de dados no ambiente virtual e torna a utilização de Sistemas de Gerenciamento de Banco de Dados(SGBDs) uma tendência no meio empresarial. O presente Trabalho de Conclusão de Curso apresenta o desenvolvimento de um sistema web destinado a realizar a gerência dos processos jurídicos que são acompanhados pelo escritório WB Advocacia na qualidade de patrono das causas. Atualmente no escritório da WB Advocacia os registros referentes aos processos são feitos de maneira manual e por meio de planilhas. Com a finalidade de otimizar a gestão das causas defendidas pelo escritório, o sistema que foi desenvolvido buscou automatizar o controle desses processos, facilitando consultas aos dados contidos em cada uma das causas, como por exemplo o andamento e a natureza do processo.",
        "abstract": "",
        "link_acesso": "https://bdtcbra.omeka.net/items/show/324",
        "arquivo_pdf": "",
        "tipo_trabalho": "TCC"
    },
    {
        "titulo": "Utilização do modelo SAAS através da computação em nuvem e o relato de uma migração entre nuvens realizada com sucesso",
        "autor": "Pereira, Wislon Júnio Gomes",
        "orientador": "Mendes Cesar, Hugo do Carmo (Orient.)",
        "coorientador": "",
        "ano": "2023",
        "curso": "Tecnologia em Sistemas para Internet",
        "instituicao": "Instituto Federal de Brasília - Campus Brasília",
        "palavras_chave": "Internet; Computação; Nuvem; Informação; SaaS",
        "resumo": "As organizações alcançam suas metas e atingem seus objetivos utilizando as soluções oferecidas via internet, obtendo ganhos no mercado competitivo com procedimentos eficientes, visto que a internet é uma das poucas plataformas operacionais que funcionam sem centros de controle sendo considerado este fator como determinante para o seu sucesso. Os processos, as informações, os sistemas de rede, são recursos importantes para a empresa e devem possuir os requisitos de confidencialidade, integridade e disponibilidade, sendo importante arma de vantagem competitiva das organizações. Em contrapartida tais redes e dados são confrontados com ameaças sofisticadas, incluindo: fraudes virtuais, espionagem, sabotagem, vandalismo, vírus, negação de serviço bem como podem ser atingidos por fenômenos da natureza como incêndios, inundações, etc. A computação em nuvens, ou cloud computing, consiste em colocar dados, softwares e hardwares na rede, sem precisar manter os aplicativos, os computadores e nem as bases de dados dentro da própria organização, apresentando economia em se investir em uma ampla infraestrutura de TI (Tecnologia da Informação) dentro da empresa. O presente estudo consiste em uma pesquisa bibliográfica exploratória, com ênfase em textos de tecnologia da informação, como livros da área técnica de computação, e artigos publicados relacionados à segurança da informação na computação em nuvens, procurando responder a questões referentes às vantagens e riscos de uma nuvem implantada dentro da empresa; com isso, será apresentado um estudo de caso real entre nuvens da empresa Central IT, para a ferramenta de ITSM que utiliza o modelo SaaS, o CITSmart.",
        "abstract": "",
        "link_acesso": "https://bdtcbra.omeka.net/items/show/1001",
        "arquivo_pdf": "",
        "tipo_trabalho": "TCC"
    },
    {
        "titulo": "Aplicação de modelos de aprendizado de máquina para detecção de fraudes em transações de cartões de crédito",
        "autor": "Dantas, João Paulo Pires",
        "orientador": "Neves, Ana Régia de Mendonça (Orient.)",
        "coorientador": "",
        "ano": "2022",
        "curso": "Tecnologia em Sistemas para Internet",
        "instituicao": "Instituto Federal de Brasília - Campus Brasília",
        "palavras_chave": "Sistemas de detecção de fraudes; Técnicas de aprendizado de máquina; Transações financeiras",
        "resumo": "A fraude em transações de cartões de crédito no Brasil representa perdas anuais estimadas em sete bilhões de dólares, sendo que, entre outros fatores, a razão desse volume ocorre devido aos atuais sistemas de detecção de fraudes serem baseados fortemente em regras de cenários de fraude. Esse modelo tradicional tende a não apresentar precisão e acurácia suficientes para a identificação de fraudes, o que acaba prejudicando clientes transacionando operações legítimas. As técnicas de aprendizado de máquina aplicadas nos sistemas de detecção de fraudes permitem que as máquinas assimilem padrões das transações e detectem sua legitimidade com precisão e acurácia. Assim, o objetivo desta pesquisa é de, com base nos resultados de uma revisão sistemática, identificar qual a técnica de aprendizado de máquina poderá ter maior desempenho na detecção de fraudes nesse contexto. Foram comparadas sete técnicas de aprendizado de máquina para criação dos modelos classificadores e a técnica SMOTE para pré- processamento dos dados. Os resultados obtidos mostraram que a aplicação dessa técnica de pré-processamento associada a alteração de hiperparâmetros contribuiu na melhoria dos resultados de três dassete técnicas, sendo que entre todas as técnicas, destacou-se a técnica Random Forest com resultado de F1-score de 98%. A aplicação de técnicas de aprendizado de máquina em sistemas de detecção de fraudes é viável a partir dos resultados apresentados e pode contribuir para aumentar a segurança desses sistemas. A aplicação de técnicas de aprendizado de máquina pode aumentar a segurança dos sistemas de detecção de fraudes com base nos resultados obtidos nesta pesquisa. Portanto, isso é relevante em um contexto global de crescente volume de transações financeiras devido à digitalização de serviços e negócios onde bilhões de transações ocorrem todos os dias.",
        "abstract": "",
        "link_acesso": "https://bdtcbra.omeka.net/items/show/611",
        "arquivo_pdf": "",
        "tipo_trabalho": "TCC"
    },
    {
        "titulo": "Desenvolvimento de um sistema para gestão de condomínio personalizado",
        "autor": "Araújo, João Paulo Oliveira; Andrade, Marcos Vasconcellos de",
        "orientador": "Silva, Alisson Wilker Andrade (Orient.)",
        "coorientador": "",
        "ano": "2020",
        "curso": "Tecnologia em Sistemas para Internet",
        "instituicao": "Instituto Federal de Brasília - Campus Brasília",
        "palavras_chave": "Gestão de condomínio; Website; JavaScript",
        "resumo": "Esse projeto descreve o processo de desenvolvimento de um Sistema de gestão de condomínio personalizado, que tem por objetivo auxiliar o síndico (administrador) a gerenciar o condomínio de uma forma mais ágil e transparente, possibilitando uma comunicação mais eficiente e eficaz com os seus condôminos, sendo que todo esse gerenciamento e comunicação é online e pode ser realizada de qualquer localidade que os usuários (administrador/condômino) estiverem e que tenham acesso à internet, pois é necessário se cadastrarem no sistema e através de seu login criado terão acesso ao Website e ter toda as vantagens que o sistema oferece. O Website também pode ser acessado de um smartphone ou tablet, pois todo ele é responsivo dando assim uma ótima navegabilidade por todo sistema. Como tecnologias de desenvolvimento, foi utilizado o JavaScript, no backend foi utilizado o NodeJS, no Frontend utilizado o VueJS e o Banco de Dados utilizamos o PostgreSQL e o MongoDB. O Sistema auxilia no cadastro de usuários, podendo ser realizado pelo síndico ou pelo próprio condômino; auxilia o síndico na gestão de cadastro, alteração ou exclusão de qualquer usuário na base de dados, através da Interface do Administrador; auxilia o Administrador na disponibilidade de incluir, alterar ou excluir avisos e notícias e controle de estacionamento e condôminos, portanto o sistema já é de grande auxílio na gestão do condomínio, mas, com o foco em uma ampliação no futuro, para que sejam alcançadas todas as demandas possíveis relacionadas ao condomínio.",
        "abstract": "",
        "link_acesso": "https://bdtcbra.omeka.net/items/show/328",
        "arquivo_pdf": "",
        "tipo_trabalho": "TCC"
    },
    {
        "titulo": "Matematiplay: jogos digitais de auxílio ao ensino da matemática para crianças",
        "autor": "Pinto Junior, Carlos Rodrigues; Barroso, Hayssa Gabrielly Brito",
        "orientador": "Santos, Sylvana Karla da Silva de Lemos (Orient.)",
        "coorientador": "",
        "ano": "2024",
        "curso": "Tecnologia em Sistemas para Internet",
        "instituicao": "Instituto Federal de Brasília - Campus Brasília",
        "palavras_chave": "Matemática; Ensino; Aprendizagem; Educação infantil",
        "resumo": "Este projeto tem como objetivo o desenvolvimento de jogos digitais em formato web voltado para crianças da pré-escola, visando auxiliar de forma lúdica o seu desenvolvimento matemático, através dos princípios de contagem. A importância do uso de tecnologias educacionais como ferramenta de apoio ao aprendizado infantil é destacada, assim como a necessidade de abordagens pedagógicas inovadoras para estimular o interesse e o envolvimento das crianças nas atividades matemáticas. O estudo apresenta uma revisão de literatura relacionada à forma como é ensinada a matemática. Posteriormente, são identificadas as principais falhas no ensino que fazem muitos alunos não aprenderem de forma satisfatória. Por fim, é apresentado, de uma forma lúdica, como jogos digitais podem auxiliar no ensino da matemática. O projeto ainda envolveu a análise de sistemas análogos, a metodologia utilizada e o desenvolvimento de um site com jogos digitais online, com as respectivas tecnologias empregadas, considerando aspectos de usabilidade, interatividade e adequação à faixa etária das crianças envolvidas no projeto. Os jogos foram projetados de modo a integrar conceitos matemáticos de maneira natural e divertida, promovendo o aprendizado por meio da experimentação e da resolução de problemas. Foram conduzidos testes e experimentos com um grupo de crianças da pré-escola de uma escola particular, para que pudessem avaliar a sua eficácia como ferramenta de auxílio ao desenvolvimento matemático. Os resultados indicaram uma contribuição positiva para o estímulo do interesse das crianças pela matemática, melhorando suas habilidades cognitivas e resolução de problemas e o projeto obteve percepções valiosas sobre a integração de tecnologia educacional na educação de crianças dessa faixa etária, destacando a importância de abordagens pedagógicas contemporâneas, inovadoras e lúdicas.",
        "abstract": "",
        "link_acesso": "https://bdtcbra.omeka.net/items/show/1058",
        "arquivo_pdf": "",
        "tipo_trabalho": "TCC"
    },
    {
        "titulo": "Glycon : Gerenciamento do Índice Glicêmico de Pacientes Internados em UTI por meio de Sistemas Informatizados.",
        "autor": "Serafim, Rafael Moura da Silva; Rodrigues, Vitor Ribeiro",
        "orientador": "Segato, Tiago Henrique Faccio (Orient.)",
        "coorientador": "",
        "ano": "2021",
        "curso": "Tecnologia em Sistemas para Internet",
        "instituicao": "Instituto Federal de Brasília - Campus Brasília",
        "palavras_chave": "Unidade de terapia intensiva; Sistema de gerenciamento; Controle glicêmico",
        "resumo": "Pacientes internados em Unidade de Terapia Intensiva (UTI) exigem maior atenção e cuidado durante o tratamento, pois, normalmente, seus quadros de saúde são mais graves por estarem em estado crítico, pensando em garantir um tratamento mais eficaz, foram criados métodos de acompanhamento ao paciente, um deles é o mnemônico FAST HUG. Com o imenso volume de dados que são coletados todos os dias, os profissionais de saúde têm passado por dificuldades em gerenciar as informações de saúde do paciente, fato este que pode afetar negativamente o seu tratamento. O objetivo desta proposta é desenvolver um sistema que possa auxiliar na tarefa de gerenciamento de glicemia dos pacientes internados em uma UTI, pois tanto a hipo quanto a hiperglicemia, caso não haja um acompanhamento rigoroso pode levar o paciente crítico a óbito. A aplicação foi projetada para ser um sistema web e pode ser utilizada em computadores e smartphones por meio de um navegador. A aplicação foi testada em pacientes simulados, pois as UTIs estão passando por grandes dificuldades devido à pandemia. O resultado foi satisfatório e mostra que o aplicativo tem grande potencial para auxiliar no cotidiano das UTIs.",
        "abstract": "",
        "link_acesso": "https://bdtcbra.omeka.net/items/show/827",
        "arquivo_pdf": "",
        "tipo_trabalho": "TCC"
    },
    {
        "titulo": "Fórmula X: desenvolvimento de um objeto de aprendizagem na forma de jogo",
        "autor": "Santos, Matheus Breno Batista dos",
        "orientador": "Oliveira, Alex Helder Cordeiro de (Orient.)",
        "coorientador": "",
        "ano": "2019",
        "curso": "Tecnologia em Sistemas para Internet",
        "instituicao": "Instituto Federal de Brasília - Campus Brasília",
        "palavras_chave": "Objeto de aprendizagem; SCORM; AVA; Moodle",
        "resumo": "O pior indicativo da educação é o de matemática no ensino médio, menos de 10% dos alunos possuem ensino adequado para seu ano escolar, corroborando para o baixo engajamento estudantil. Para combater o desinteresse e a evasão escolar, professores começaram investirem em recursos digitais, o que tem elevado o engajamento estudantil. Objetos de aprendizagem (OAs) no padrão Content Object Reference Model (SCORM) têm sido a principal escolha pelas suas características: interoperáveis, reutilizáveis e duráveis. Aliados à possibilidade de integração com ambientes de virtuais de ensino-aprendizagem (AVEA), como o Moodle, eles conseguem causar impacto em sala de aula. O desenvolvimento de OAs sem uma catalogação dos já existentes gera um desperdício de recursos. Esse trabalho realiza um mapeamento sistemático sobre os objetos de aprendizagem na área de matemática publicados e disponíveis para avaliação. Devido ao número pequeno de publicações, se sugere o desenvolvimento de um novo OA voltado ao Ensino Médio. O OA desenvolvido com tecnologias web se encontra integrado ao Moodle, AVA do Instituto Federal de Brasília. Os trabalhos futuros incluem reavaliação do OA, expansão do trabalho já feito e comparações de outros AVEA e padrões de pacotes.",
        "abstract": "",
        "link_acesso": "https://bdtcbra.omeka.net/items/show/11",
        "arquivo_pdf": "",
        "tipo_trabalho": "TCC"
    },
    {
        "titulo": "Software para o programa de monitoria",
        "autor": "Gomes, Pedro Bruno Freire",
        "orientador": "Van der Linden, Marx Gomes (Orient.)",
        "coorientador": "",
        "ano": "2021",
        "curso": "Tecnologia em Sistemas para Internet",
        "instituicao": "Instituto Federal de Brasília - Campus Brasília",
        "palavras_chave": "Sistema web; Monitoria; Emissão de documentos; Controle de frequência",
        "resumo": "Esse trabalho tem como objetivo, desenvolver um sistema web para preenchimentos e emissão de documentos para o programa de monitoria do Instituto Federal do Campus Brasília. Para o desenvolvimento desse programa, foi requerido pela Coordenação-Geral de Assuntos Estudantis do Campus Brasília, uma plataforma onde os monitores e professores-orientadores possam preencher e emitir documentos de controle de frequência e demais funcionalidades. Esses documentos são emitidos e entregues para o responsável da coordenação, para que sejam realizados os envios para a Pró Reitoria de Ensino (PREN) e sejam feitos os arquivamentos. Para alcançar esse objetivo, foi realizada uma pesquisa por meio de um questionário com a demandante interessada, no qual os dados extraídos foram suficientes para que seja iniciado o prosseguimento da construção do sistema. As ferramentas utilizadas para o desenvolvimento foram o PHP, juntamente com a biblioteca mPDF para o back-end, HTML e Materialize CSS para o front-end e o sistema de gerenciamento de dados MySQL. Para a estruturação do trabalho, foi utilizada uma metodologia, que foi a pesquisa exploratória, e o resultado é uma plataforma acessada por meio de um navegador de internet, que está em fase de testes.",
        "abstract": "",
        "link_acesso": "https://bdtcbra.omeka.net/items/show/531",
        "arquivo_pdf": "",
        "tipo_trabalho": "TCC"
    },
    {
        "titulo": "Avaliação de usabilidade da interface de usuário do ventilador mecânico Ticê",
        "autor": "Silva, Mateus Lopes da",
        "orientador": "Oliveira, Fábio Henrique Monteiro (Orient.)",
        "coorientador": "",
        "ano": "2023",
        "curso": "Tecnologia em Sistemas para Internet",
        "instituicao": "Instituto Federal de Brasília - Campus Brasília",
        "palavras_chave": "Avaliação; Usabilidade; Interface de usuário; Ventilador mecânico",
        "resumo": "Os ventiladores mecânicos são equipamentos de suporte à vida de pacientes com quadro de insuficiência respiratória mais comumente utilizados nas Unidades de Terapia Intensiva (UTI) dos hospitais. O ventilador mecânico desempenha um papel primordial nas UTIs, porém muitos não possuem uma boa usabilidade e tendem a afetar negativamente a utilização por parte dos profissionais da saúde. Este trabalho avaliou a usabilidade da interface de usuário do protótipo do ventilador mecânico Ticê. Para isso, 10 profissionais da área da saúde foram convidados a participar da pesquisa. 9 tarefas relativas ao uso do equipamento foram realizadas. As métricas analisadas foram o tempo de conclusão da tarefa, erros de uso e o questionário System Usability Scale (SUS) para determinar a usabilidade da interface de usuário do VM Ticê. A análise para o tempo de conclusão das tarefas indicou que os participantes tiveram mais dificuldade para concluir a tarefa 8 (Desligar e ligar o ventilador) e mais agilidade para completar a tarefa 6 (Parar a ventilação). Para os erros de uso, as tarefas 3 (Mudança de ajuste no VCV) “Ventilação Controlada a Volume - VCV” e 8 apresentaram maiores quantidades de falhas por parte dos participantes. Os resultados do questionário SUS mostraram que todas as pontuações alcançadas foram superiores à média de 68 pontos, que é a base para interpretar se o resultado (pontuação) do sistema avaliado é positivo ou negativo em relação à usabilidade. A avaliação de usabilidade realizada no protótipo do VM Ticê mostrou resultados positivos no que se refere à eficácia, eficiência e satisfação de uso da interface de usuário do equipamento.",
        "abstract": "",
        "link_acesso": "https://bdtcbra.omeka.net/items/show/1054",
        "arquivo_pdf": "",
        "tipo_trabalho": "TCC"
    },
    {
        "titulo": "Sistema de localização de salas: SeekClass",
        "autor": "Teixeira, Brenda Lopes Miranda; Soares, Rosana da Silva",
        "orientador": "Queiroz, Diego Cesar Florencio de (Orient.)",
        "coorientador": "",
        "ano": "2021",
        "curso": "Tecnologia em Sistemas para Internet",
        "instituicao": "Instituto Federal de Brasília - Campus Brasília",
        "palavras_chave": "Sistema de localização; Salas de aula; Instituto Federal de Brasília",
        "resumo": "Esse trabalho tem como objetivo apresentar um sistema de localização de salas para auxiliar os alunos do Instituto Federal de Brasília em todo o seu período letivo, direcionando-os constantemente para suas salas, assegurando-os de seus horários de aulas e possíveis alterações. O IFB não possui nenhum sistema que auxilie o estudante ao encontrar suas salas e constantemente alunos se perdem na instituição devido ter uma estrutura extensa e a necessidade dos professores de mudarem de suas salas para utilizar os laboratórios. Esse sistema possibilita também aos professores uma comunicação ágil com as turmas, utilizando a ferramenta “avisos”, essa funcionalidade reduz quaisquer dificuldades que o aluno possa apresentar em relação a procura da sala onde a aula ocorrerá. Para alcançar os resultados esperados, foi levantada uma pesquisa para investigar as dificuldades e observar os problemas para obter uma informação exata do contratempo que é procurar a sala.",
        "abstract": "",
        "link_acesso": "https://bdtcbra.omeka.net/items/show/561",
        "arquivo_pdf": "",
        "tipo_trabalho": "TCC"
    },
    {
        "titulo": "Análise exploratória de dados geográficos de componente nativo para aplicativos híbridos",
        "autor": "Castro, Bruno Morais Neves de",
        "orientador": "Oliveira, Fábio Henrique Monteiro (Orient.)",
        "coorientador": "",
        "ano": "2019",
        "curso": "Tecnologia em Sistemas para Internet",
        "instituicao": "Instituto Federal de Brasília - Campus Brasília",
        "palavras_chave": "Aplicativos híbridos; Dispositivos móveis; Componentes nativos",
        "resumo": "O desenvolvimento de aplicativos moveis híbridos é acelerado e de baixo custo, favorecendo a produção de protótipos multiplataforma. Entretanto, o desenvolvimento hibrido pode comprometer o desempenho dos componentes que utilizam recursos nativos. Com o objetivo de validar os dados coletados com um recurso de geolocalização disponível para o framework Ionic, foi desenvolvido um aplicativo móvel híbrido para coleta de dados do componente e apresentada uma análise exploratória sobre os dados coletados, e sua proximidade com os dados de localização de uma solução ao nativa. Com isso, foi utilizada a formula de Haversine para avaliar a qualidade dos dados, que apresentaram distância considerável entre os registros.",
        "abstract": "",
        "link_acesso": "https://bdtcbra.omeka.net/items/show/9",
        "arquivo_pdf": "",
        "tipo_trabalho": "TCC"
    },
    {
        "titulo": "Desenvolvimento de um sistema para participação de torcedores na escalação de times de futebol",
        "autor": "Souza, Matthaus Siqueira de; Brito, Rafael Warley Sena",
        "orientador": "Barros, Heitor José Dos Santos (Orient.)",
        "coorientador": "",
        "ano": "2022",
        "curso": "Tecnologia em Sistemas para Internet",
        "instituicao": "Instituto Federal de Brasília - Campus Brasília",
        "palavras_chave": "Futebol; Clubes; Torcida; Treinador; Sistema",
        "resumo": "O uso de tecnologias digitais vem crescendo cada vez mais no mundo, e com isso se modifica a rotina e o jeito de se viver e pensar. No âmbito esportivo ocorre a mesma coisa, no qual a tecnologia entra como uma forma de resolver problemas, melhorar o desempenho dos atletas e trazer novas formas de se trabalhar e jogar. Diante deste cenário, pensou-se em desenvolver um sistema que aproximasse o treinador da torcida, permitindo aos torcedores escalarem parte do time, a partir da filosofia de jogo passada pelo treinador. Esta dinâmica ocorreu através do programa de sócio torcedor, no qual, o indivíduo paga uma quantia ao clube para ter alguns benefícios exclusivos e no caso um desses benefícios seria ajudar na escalação do seu time, podendo ser uma forma de atrair mais sócios e gerar mais receita aos clubes. Com isso este projeto buscou implementar uma forma de aproximar torcidas e treinadores e consequentemente aproximar a torcida ainda mais dos clubes, como também ser mais uma forma de arrecadação para estes.",
        "abstract": "",
        "link_acesso": "https://bdtcbra.omeka.net/items/show/802",
        "arquivo_pdf": "",
        "tipo_trabalho": "TCC"
    },
    {
        "titulo": "Sistema de atendimento para a Coordenação Geral de Assistência Estudantil",
        "autor": "Nascimento, José Neto Lima",
        "orientador": "Oliveira, Alex Helder Cordeiro de (Orient.)",
        "coorientador": "",
        "ano": "2021",
        "curso": "Tecnologia em Sistemas para Internet",
        "instituicao": "Instituto Federal de Brasília - Campus Brasília",
        "palavras_chave": "Java; Padrão MVC; Instituto Federal de Brasília; Sistema desktop; Desenvolvimento de software",
        "resumo": "O presente trabalho tem como objetivo apresentar as etapas de desenvolvimento de um sistema para fazer o controle do fluxo de atendimentos que são feitos no decorrer do expediente da Coordenação Geral de Assistência Estudantil (CGAE) do Instituto Federal de Brasília (IFB) - Campus Brasília. Após algumas reuniões com o demandante, foram notadas diversas necessidades que o modelo de trabalho atual não supria, com todos os problemas levantados após as reuniões, foram feitas diversas etapas para levantar todas as funcionalidades que o sistema deveria ter para que os problemas fossem resolvidos e automatizados. Chegou a fase de desenvolvimento, foi usada a linguagem de programação JAVA, utilizando-se o padrão MVC (model, view e controller). Antes da implantação foram feitos vários testes para comprovar que todas as necessidades estavam sendo atendidas. Quanto a implantação do sistema, devido aos tempos de pandemia, ainda não foi possível instalar o sistema no Instituto Federal, utilizou-se uma rede com dois computadores para testar a compatibilidade de sistema e eventuais erros que pudessem estar ocorrendo. Após a conclusão de todas as etapas da implantação do sistema, ficará destinado ao Coordenação Geral de Assistência e Estudantil do IFB, para manutenção e futuras atualizações.",
        "abstract": "",
        "link_acesso": "https://bdtcbra.omeka.net/items/show/457",
        "arquivo_pdf": "",
        "tipo_trabalho": "TCC"
    },
    {
        "titulo": "CUDA-Sankoff-Web: uma ferramenta web para cálculo do alinhamento secundário estrutural ótimo",
        "autor": "Gomes, Rodrigo Rocha",
        "orientador": "Lima, Daniel Sundfeld (Orient.)",
        "coorientador": "",
        "ano": "2020",
        "curso": "Tecnologia em Sistemas para Internet",
        "instituicao": "Instituto Federal de Brasília - Campus Brasília",
        "palavras_chave": "Bioinformática; Alinhamento de sequências; RNA; CUDA-Sankoff",
        "resumo": "O alinhamento de sequencias é uma das operações mais importantes para a Bioinformática. Ao se considerar sequencias de RNA, não basta considerar apenas a sequência em si, mas tambem devem ser consideradas as estruturas que essas sequencias podem formar. Essa estrutura pode ser simplificada em um plano 2D e é conhecida como estrutura secundária. Recentemente, o algoritmo CUDA-Sankoff foi proposto para obter o alinhamento ótimo secundário de sequências de RNA em um tempo razoável. No entanto, essa ferrramenta não possui interface amigável e exige um conhecimento técnico alto de quem irá utilizá-la. Neste trabalho, propomos criar um webserver para facilitar a execução do algoritmo CUDA-Sankoff, permitindo que os usuários possam facilmente obter os resultados.",
        "abstract": "",
        "link_acesso": "https://bdtcbra.omeka.net/items/show/323",
        "arquivo_pdf": "",
        "tipo_trabalho": "TCC"
    },
    {
        "titulo": "Eu quero estudar (EQES) plataforma de buscas de oportunidade de estudos gratuito",
        "autor": "Ribeiro, Lucas Pereira Sodré",
        "orientador": "Fustinoni, Diógenes Ferreira Reis (Orient.)",
        "coorientador": "",
        "ano": "2022",
        "curso": "Tecnologia em Sistemas para Internet",
        "instituicao": "Instituto Federal de Brasília - Campus Brasília",
        "palavras_chave": "Cursos e oportunidades; Área educacional; Ensino Médio; Graduação",
        "resumo": "Este trabalho propõe o desenvolvimento de uma aplicação, cuja finalidade é concentrar e facilitar a divulgação desses cursos e oportunidades da área educacional num canal Web de divulgação, uma espécie de rede social colaborativa. O sistema proposto tem o nome representado pelas siglas EQES, que significa Eu Quero Estudar, e possibilita ao usuário a visualização e o compartilhamento de informações de relacionadas a oportunidades educacionais.",
        "abstract": "",
        "link_acesso": "https://bdtcbra.omeka.net/items/show/699",
        "arquivo_pdf": "",
        "tipo_trabalho": "TCC"
    },
    {
        "titulo": "Desenvolvimento de um dashboard web para a visualização de dados relacionados à doença de Parkinson",
        "autor": "Oliveira, Lissa Victoria Ximenes de; Conceição, Lucas Raiony Rosa da",
        "orientador": "Oliveira, Fabio Henrique Monteiro (Orient.)",
        "coorientador": "",
        "ano": "2022",
        "curso": "Tecnologia em Sistemas para Internet",
        "instituicao": "Instituto Federal de Brasília - Campus Brasília",
        "palavras_chave": "Doença de Parkinson; Escala unificada de diagnóstico de Parkinson; Tecnologia de front-end; User experience; Dashboard",
        "resumo": "A doença de Parkinson (DP) é uma enfermidade crônica onde ocorre a perda de neurônios dopaminérgicos e com isso causa diversos sintomas que podem prejudicar a qualidade de vida do indivíduo acometido. O processo de diagnóstico desta doença funciona majoritariamente de forma clínica. Dentre as ferramentas utilizada no processo clínico, esta a escala unificada de classificação da doença de Parkinson, do inglês Unified Parkinson’s Disease Rating Scale (UPDRS). Por se tratar de um questionário extenso que e aplicado muitas vezes, os profissionais podem enfrentar dificuldades ao organizar os dados do relatório. Com o intuito de melhorar o processo de avaliação com a escala, este trabalho se dedica a identificar problemas no uso da mesma e a elaborar e desenvolver um dashboard para a visualização dos resultados dos processos relacionados à UPDRS.",
        "abstract": "",
        "link_acesso": "https://bdtcbra.omeka.net/items/show/781",
        "arquivo_pdf": "",
        "tipo_trabalho": "TCC"
    },
    {
        "titulo": "Análise de segurança do software RRG Construção: boas práticas aplicado ao desenvolvimento de software seguro",
        "autor": "Ornelas, Ingrid Laila Santana; DeolinoI, Michel Clemer Monteiro",
        "orientador": "Fustinoni, Diógenes Ferreira Reis (Orient.)",
        "coorientador": "",
        "ano": "2020",
        "curso": "Tecnologia em Sistemas para Internet",
        "instituicao": "Instituto Federal de Brasília - Campus Brasília",
        "palavras_chave": "Segurança; Aplicações web; Ataques a sistemas",
        "resumo": "Frente à evolução das diversas tecnologias vem também os ataques contra esses sistemas e serviços. Este trabalho irá abordar de uma maneira ampla a análise de segurança em uma aplicação web baseada em java. É ilustrado a aplicação de boas práticas de segurança nas etapas de desenvolvimento até a fase de teste de segurança. Por fim, é ilustrado as medidas corretivas que podem minimizar os ataques de hackers.",
        "abstract": "",
        "link_acesso": "https://bdtcbra.omeka.net/items/show/337",
        "arquivo_pdf": "",
        "tipo_trabalho": "TCC"
    },
    {
        "titulo": "Construção de aplicativo para orientação ao Programa de Doze Passos do Alcoólicos Anônimos",
        "autor": "Rodrigues, Ian Gabriel Costa; Silva, Thayse Fernandes da",
        "orientador": "Fernandez, Fábio Ferraz (Orient.)",
        "coorientador": "",
        "ano": "2022",
        "curso": "Tecnologia em Sistemas para Internet",
        "instituicao": "Instituto Federal de Brasília - Campus Brasília",
        "palavras_chave": "Alcoolismo; Alcoólicos Anônimos; Aplicação mobile; Doze passos",
        "resumo": "O alcoolismo pode ser definido como a necessidade de grandes quantidades de álcool para o funcionamento da pessoa dependente, e leva a diversos comportamentos como o mau funcionamento social, dificuldades legais causadas por embriaguez, repetição da intoxicação e ingestão de álcool não potável para escapar dos sintomas de abstinência, que ocorre durante a falta da substância no organismo. Para auxiliar dependentes alcoólicos a alcançarem a sobriedade, foi criada a Instituição do Alcoólicos Anônimos, que utiliza uma série de princípios de natureza espiritual para ajudar na jornada pela desintoxicação chamados de Doze Passos. Durante a pandemia de COVID-19 houve um aumento dos índices de alcoolismo na população, fazendo com que a procura por ajuda na Instituição do Alcoólicos Anônimos também aumentasse e evidenciando a falta de preparo na distribuição de material de referência para auxiliar os dependentes no processo de recuperação em um ambiente online. Este trabalho propõe o desenvolvimento de uma aplicação que auxilie a Instituição do Alcoólicos Anônimos a entregar seu material de referência de forma facilitada e promover ajuda na busca pela sobriedade através do compartilhamento de depoimentos. Para atingir este objetivo, foi utilizada a linguagem de programação Javascript por meio do Node.js e React Native para construir um aplicativo com as funcionalidades de login, cadastro, visualização dos Doze Passos da Instituição, cadastro de objetivos, diário de recuperação e depoimentos e visualização de objetivos, registros do diário e depoimentos de outros usuários. Para validar o aplicativo desenvolvido foram efetuados testes de carga utilizando os softwares Prometheus e Grafana para comprovar que é possível utilizar o Minimun Viable Product (Produto Mínimo Viável) (MVP) desenvolvido em pequenos grupos.",
        "abstract": "",
        "link_acesso": "https://bdtcbra.omeka.net/items/show/687",
        "arquivo_pdf": "",
        "tipo_trabalho": "TCC"
    },
    {
        "titulo": "Jogo educativo de circuitos com sistema para criação de fases",
        "autor": "Borges, Pedro Stewart Silva",
        "orientador": "Van der Linden, Marx Gomes (Orient.)",
        "coorientador": "",
        "ano": "2022",
        "curso": "Tecnologia em Sistemas para Internet",
        "instituicao": "Instituto Federal de Brasília - Campus Brasília",
        "palavras_chave": "Jogos educativos; Ensino e aprendizagem; Programação",
        "resumo": "Este trabalho trata do desenvolvimento de um jogo educativo para a plataforma Guejibo, que é uma plataforma de jogos educacionais. O jogo denomina-se \"Torne Verdadeiro\" e consiste em apresentar ao usuário uma série de circuitos para que o jogador possa encontrar a combinação correta de 1 e 0, no menor tempo possível e com a menor quantidade de cliques. Ele é inspirado em um jogo já existente chamado Make It True, porém, além de ser adaptado para navegadores web, possui funcionalidades novas, como permitir ao usuário que crie os próprios circuitos. Foi desenvolvido com as linguagens HTML, CSS e JavaScript e pôde-se observar que este superou em diversos aspectos o Make It True. Com isso, espera-se um jogo funcional, que cumpra a sua proposta educacional e que seja divertido para quem jogar.",
        "abstract": "",
        "link_acesso": "https://bdtcbra.omeka.net/items/show/773",
        "arquivo_pdf": "",
        "tipo_trabalho": "TCC"
    },
    {
        "titulo": "VISS: sistema de monitoramento e análise de sinais vitais de pacientes internados em Unidade de Terapia Intensiva",
        "autor": "Rocha Júnior, Julio Cesar Gonçalves da",
        "orientador": "Segato, Tiago Henrique Facci (Orient.); Fernandes, Sérgio Eduardo Soares (Coorient.)",
        "coorientador": "",
        "ano": "2023",
        "curso": "Tecnologia em Sistemas para Internet",
        "instituicao": "Instituto Federal de Brasília - Campus Brasília",
        "palavras_chave": "Informatização hospitalar; Monitoramento de pacientes críticos; UTI; Sinais vitais; Folhão de sinais",
        "resumo": "Visto o cenário atual da área da saúde, onde o uso da tecnologia se faz cada vez mais presente, mostrando-se uma grande aliada no que se refere à otimização do trabalho dos agentes de saúde, além da recuperação de seus pacientes, este trabalho tem por objetivo a otimização do processo de coleta e monitoramento de pacientes internados em Unidade de Terapia Intensiva (UTI), pois atualmente, este processo é feito em grande parte das UTI’s de forma manual. Com isso, a proposta desse trabalho é o desenvolvimento de uma aplicação web que informatize este processo, possibilitando assim, uma celeridade e eficácia maiores. Na metodologia utilizada para a elaboração do sistema foi realizado o estudo de viabilidade da proposta, buscando correlatos que justificassem o desenvolvimento do trabalho, também foi estudada a Folha de Avaliação de Continuada e as tecnologias necessárias para a aplicação. Na sequência foi realizada a modelagem do sistema, levantando os requisitos necessários e realizando a prototipação do sistema. Por fim, foi realizada a implementação e testes do sistema proposto. Os testes realizados comprovaram a eficácia e utilidade do sistema no processo de coleta, armazenamento e análise dos sinais vitais dos pacientes críticos de UTI.",
        "abstract": "",
        "link_acesso": "https://bdtcbra.omeka.net/items/show/976",
        "arquivo_pdf": "",
        "tipo_trabalho": "TCC"
    },
    {
        "titulo": "Tecnologia educacional para o apoio ao ensino de lógica de programação em cursos de informática do nível técnico ao ensino superior",
        "autor": "Duarte, Kenia Pereira; Lopes, Samuel Araújo",
        "orientador": "Bonfim, Cristiane Jorge de Lima (Orient.)",
        "coorientador": "",
        "ano": "2021",
        "curso": "Tecnologia em Sistemas para Internet",
        "instituicao": "Instituto Federal de Brasília - Campus Brasília",
        "palavras_chave": "Plataformas de ensino; Lógica de programação; Dificuldade de aprendizagem",
        "resumo": "Este trabalho teve por objetivo desenvolver um aplicativo educacional aplicado ao ensino de lógica de programação para auxiliar a aprendizagem dos estudantes do Ensino Médio Integrado e Superior de Tecnologia em Sistemas para Internet. Foi realizada uma revisão bibliográfica em artigos científicos sobre dificuldades de aprendizagem e abordagens de ensino. Também realizamos um levantamento inicial de requisitos para o aplicativo por meio de formulário com estudantes do EMI e TSI. O desenvolvimento do artefato utilizou a metodologia DSR (Design Science Research), que por meio da revisão de bibliografia possibilitou desenvolver uma proposta de design no aplicativo baseada em conhecimento científico. O referencial teórico tem em sua estrutura, metodologias e tecnologias para o ensino de lógica de programação, estilos de aprendizagem no Ensino Médio e Superior, ensino de lógica de programação mediada por tecnologia educacional, desenvolvimento e qualidade de software, e as heurísticas de usabilidade e UX para melhor aperfeiçoamento do aplicativo. Na fase de teste do aplicativo, realizamos pesquisas através de formulários e os resultados foram promissores quanto ao desempenho do aplicativo e o design.",
        "abstract": "",
        "link_acesso": "https://bdtcbra.omeka.net/items/show/526",
        "arquivo_pdf": "",
        "tipo_trabalho": "TCC"
    },
    {
        "titulo": "GoPark: sistema de controle e gerenciamento de estacionamento",
        "autor": "Mota, Matheus Nícollas de Souza",
        "orientador": "Van der Linden, Marx Gomes (Orient.)",
        "coorientador": "",
        "ano": "2021",
        "curso": "Tecnologia em Sistemas para Internet",
        "instituicao": "Instituto Federal de Brasília - Campus Brasília",
        "palavras_chave": "Sistema web; Automatização; Estacionamento",
        "resumo": "O presente trabalho tem o objetivo de apresentar a proposta de desenvolvimento de um sistema web para a automatização, interoperabilidade e gerência do estacionamento do Taguatinga Shopping. O sistema atual, o qual está implantado no estabelecimento, efetua cadastros de funcionários e pagamentos efetivados por totens físicos para transações digitais ou caixas para pagamentos em dinheiro, métodos estes que mesmo bem distribuídos localmente ocasionam a formação de filas em dias de maiores fluxos. O GoPark soluciona muitos problemas e oferece soluções novas como: controle individual do fluxo de vagas, pagamento por aplicativo móvel, relatório de pagamentos e visualização ilustrativa das vagas em tempo real, funções estas que adicionam benefícios e funcionalidades novas para o estacionamento, tornando a regra de negócio mais gerenciável e digital.",
        "abstract": "",
        "link_acesso": "https://bdtcbra.omeka.net/items/show/525",
        "arquivo_pdf": "",
        "tipo_trabalho": "TCC"
    },
    {
        "titulo": "Classificador automático baseado em aprendizado de máquina para detecção de epidemias no Twitter",
        "autor": "Oliveira, Marcos Rian Tomé de",
        "orientador": "Neves, Ana Régia de Mendonça (Orient.)",
        "coorientador": "",
        "ano": "2022",
        "curso": "Tecnologia em Sistemas para Internet",
        "instituicao": "Instituto Federal de Brasília - Campus Brasília",
        "palavras_chave": "Mineração de texto; Técnicas de aprendizagens de máquina; Regressão Logística Multiclasse",
        "resumo": "Em dezembro de 2019 o mundo foi surpreendido por uma doença potencialmente transmissível conhecida por coronavírus ou Covid-19, logo, diversos países começaram uma corrida contra o tempo para a produção o de vacinas e meios de minimizar essa possível transmissao. No Brasil e no mundo foram feitos métodos e estudos para um acompanhamento detalhado do quadro de evolução da Covid, todavia, não foi possível obter com êxito um resultado preciso sobre a nvestigação do cenário. Contudo, a utilização da mineração de textos para aprimoramento de técnicas de aprendizado de máquina estão crescendo cada vez mais globalmente, para diferentes areas e objetivos. Este meio de estudo pode funcionar de forma mais pragmático com as redes sociais, ́pois, elas permitem uma interatividade maior na troca de informações entre pessoas. Com isto, o objetivo deste artigo e realizar a mineração de textos no Twitter, a fim de que seja construído um classificador automatico utilizando técnica de aprendizado de máquina para detecção automática de possíveis casos do vírus e futuras epidemias. Foram comparadas duas técnicas de aprendizado, na qual Regressão Logística Multiclasse destacou-se apresentando um resultado de acuracia de 75%. ́",
        "abstract": "",
        "link_acesso": "https://bdtcbra.omeka.net/items/show/670",
        "arquivo_pdf": "",
        "tipo_trabalho": "TCC"
    },
    {
        "titulo": "Desenvolvimento de uma aplicação para eventos utilizando a metodologia Progressive Web app com frameworks modernos",
        "autor": "Costa, Thiago Aquino",
        "orientador": "Segato, Tiago Henrique Faccio (Orient.)",
        "coorientador": "",
        "ano": "2019",
        "curso": "Tecnologia em Sistemas para Internet",
        "instituicao": "Instituto Federal de Brasília - Campus Brasília",
        "palavras_chave": "Aplicação web; Frameworks; ReactJS; PWA",
        "resumo": "Para um bom desenvolvimento de uma aplicação mobile é indispensável conhecer novas maneiras de desenvolver algo, pensar em novas tecnologias, quais ferramentas serão utilizadas e até onde elas podem chegar. Em um mercado de aplicações para dispositivos móveis liderado por aplicativos nativos, híbridos e web apps uma nova abordagem com metodologias próprias surgiu para fazer parte desse escopo. Essa metodologia se chama Progressive Web App (PWA), onde unem-se algumas ferramentas e metodologias para tornar as aplicações web tão eficientes quanto as nativas. Este trabalho propõe um desenvolvimento de uma aplicação para eventos que atenda tais requisitos e para isso foi pensado no desenvolvimento de um projeto experimental para o evento que ocorre anualmente no Instituto Federal de Brasília - Campus Brasília, o IF Tech. Utilizando-se de frameworks modernos como o ReactJS e GatsbyJS, tal aplicação foi desenvolvida e testada demonstrando se a mesma possui as características exigidas para ser considerada um PWA.",
        "abstract": "",
        "link_acesso": "https://bdtcbra.omeka.net/items/show/29",
        "arquivo_pdf": "",
        "tipo_trabalho": "TCC"
    },
    {
        "titulo": "Sistema de gerenciamento do tempo de uso dos terminais de pesquisa acadêmica da biblioteca",
        "autor": "Silva, Luiz Fernando de Jesus da",
        "orientador": "Bonfim, Cristiane Jorge de Lima (Orient.)",
        "coorientador": "",
        "ano": "2019",
        "curso": "Tecnologia em Sistemas para Internet",
        "instituicao": "Instituto Federal de Brasília - Campus Brasília",
        "palavras_chave": "Sistema web/desktop; Padrão MVC; Biblioteca; Pesquisa acadêmica",
        "resumo": "Este trabalho tem como principal finalidade o desenvolvimento de um sistema web/desktop de controle do tempo de uso dos computadores para realização de pesquisas acadêmicas, situados na biblioteca do IFB – Campus Brasília. Para alcançar este objetivo, foi realizada uma pesquisa exploratória a fim de investigar o problema e formular uma hipótese mais precisa, seguida pela realização de uma entrevista semiestruturada com a parte cliente. Após a análise dos dados coletados, foi identificado o problema da falta de controle do tempo de uso dos terminais. Em seguida procedeu-se com o desenvolvimento, implementação e testes do sistema, que foi desenvolvido com as linguagens de programação PHP e C# (Csharp), utilizando-se o Padrão MVC (Model, view e controller ). Quanto aos testes, foram coletados os dados quanto à sua utilização, com o uso de um formulário online respondido pelos usuários após a autenticação da senha recebida (token). As informações coletadas identificaram a satisfação dos usuários, sendo que 82% aprovaram o sistema com o nível de satisfação com notas entre 6 e 10, enquanto apenas 18% apontaram o baixo nível de satisfação, compreendendo as notas de 1 a 5. Após a conclusão, o sistema será destinado à Diretoria de Informação e Comunicação do IFB (DTIC) para suporte e futuras atualizações.",
        "abstract": "",
        "link_acesso": "https://bdtcbra.omeka.net/items/show/31",
        "arquivo_pdf": "",
        "tipo_trabalho": "TCC"
    },
    {
        "titulo": "Estudo dos princípios do Design-Based Research e do Technologycal Pedagogical em Content Knowledge para o desenvolvimento de plataforma web de gestão acadêmica",
        "autor": "Valdés, Ribson Coelho Cardoch",
        "orientador": "Bonfim, Cristiane Jorge de Lima (Orient.)",
        "coorientador": "",
        "ano": "2021",
        "curso": "Tecnologia em Sistemas para Internet",
        "instituicao": "Instituto Federal de Brasília - Campus Brasília",
        "palavras_chave": "Design Based Research; Plataforma web; Aprendizagem; Tecnologycal Pedagogical Content Knowledge; Django; Python",
        "resumo": "Este trabalho tem o objetivo de iniciar um estudo sobre dois frameworks: o Technologycal Pedagogical and Content Knowledge, e a metodologia Design-Based Research . Esses dois frameworks são usados no processo de ensino/aprendizagem e propõe o uso de tecnologias junto ao conhecimento didático e pedagógico. Será desenvolvido uma plataforma web que terá como funcionalidade principal um CRUD (create, retrieve, update, and delete) das entidades: Disciplina, Professor, Aluno, e Questão. Esta plataforma web é um exemplo de associação da tecnologia com o processo de ensino/aprendizagem, que serve para auxiliar o professor na sua jornada de ensino e os alunos na sua de aprendizagem. O conhecimento tecnológico do conteúdo-TPACK propõe uma análise de três aspectos que influenciam no processo ensino e aprendizagem: o conhecimento do conteúdo, o conhecimento pedagógico, e o conhecimento tecnológico dentro do contexto de ensino e aprendizagem. O Design-Based Research-DBR é uma metodologia da área de educação que permite uma intervenção no contexto escolar com a participação e colaboração de especialistas, e de pesquisadores. A DBR utiliza ciclos de análises no processo de definição da solução do problema abordado, provocando alterações no design do artefato, ou ferramenta, a ser desenvolvida. O Referencial Teórico abordará os temas sobre o TPACK, a DBR, o processo ensino aprendizagem, e a Engenharia de Software. Na seção Recursos Tecnológicos apresentamos o desenvolvimento da plataforma Web, que será feito utilizando algumas ferramentas e linguagens, como a linguagem de programação Python, HTML, CSS, JavaScript, o framework Django, o framework Bootstrap, o SGBD Postgres, e a IDE Visual Studio Code. Em Sistemas Similares, a pesquisa inicial identificou alguns sistemas similares, entre os quais destacamos três, suas vantagens e desvantagens. Na metodologia é descrita a caracterização da pesquisa, a aplicação do TPACK e da DBR para solução dos problemas de ensino e aprendizagem. Uma Plataforma web proposta pelo projeto é apresentada, após aceite do demandante. Esta plataforma irá implementar algumas funcionalidades para solução dos problemas encontrados, as demais serão tratadas em trabalhos futuros.",
        "abstract": "",
        "link_acesso": "https://bdtcbra.omeka.net/items/show/429",
        "arquivo_pdf": "",
        "tipo_trabalho": "TCC"
    },
    {
        "titulo": "Sistema de notificacão de quedas através da computação em nuvem",
        "autor": "Freitas Junior, Levi Alves de",
        "orientador": "Lima, Daniel Sundfeld (Orient.)",
        "coorientador": "",
        "ano": "2021",
        "curso": "Tecnologia em Sistemas para Internet",
        "instituicao": "Instituto Federal de Brasília - Campus Brasília",
        "palavras_chave": "Idosos; Acidentes domésticos; Sistema de detecção de quedas; Computação em nuvem",
        "resumo": "O numero de idosos morando sozinhos tem continuamente aumentado nos últimos anos. Uma das maiores preocupações que existe com este ultimo grupo são os acidentes domésticos, onde as quedas são um importante incidente desse grupo. Ao se planejar um sistema de detecção de quedas, é importante planejar um sistema de alta disponibilidade, devido a situação de emergência. A computação em nuvem pode ser utilizada para atingir esse objetivo. Recentemente, vários sistemas de arquitetura sem servidor, onde o provedor em nuvem e responsável por manter a infraestrutura do serviço e o desenvolvedor possui uma plataforma de alta disponibilidade e escalabilidade. Nesse trabalho, propomos e implementamos uma arquitetura sem servidor para ser utilizada em um sistema de detecção de quedas usando o smartphone. Desta forma, conseguimos criar uma estrutura com alta disponibilidade, muito importante para situações de emergência, e que não possui um alto custo associado a ela.",
        "abstract": "",
        "link_acesso": "https://bdtcbra.omeka.net/items/show/538",
        "arquivo_pdf": "",
        "tipo_trabalho": "TCC"
    },
    {
        "titulo": "Sistema de realidade virtual na preservação histórica de informações",
        "autor": "Jacobina, Gabriel dos Santos; Sena, Johnatan Brayan de Lima",
        "orientador": "Deus, Gustavo Henrique Dornelas de (Orient.); Lima, Lázaro Vinícius de Oliveira (Coorient.)",
        "coorientador": "",
        "ano": "2021",
        "curso": "Tecnologia em Sistemas para Internet",
        "instituicao": "Instituto Federal de Brasília - Campus Brasília",
        "palavras_chave": "Realidade virtual; Preservação da informação; Patrimônio cultural; Registro temporal",
        "resumo": "A preservação da informação demanda esforço e motivação e, para tal, se faz necessária a compreensão do contexto histórico. Nesta linha, esse projeto objetiva a criação de um sistema que permite um registro temporal de sítios com finalidades artísticas e culturais para registro das características originais e das possíveis modificações por meio de tecnologias de realidade virtual. Para isso usou-se o método de Design Science Research que propõe desenvolver conhecimento para a concepção e desenvolvimento de artefatos, que por sua vez, serão criados usando tecnologias como Java que é uma linguagem de programação orientada a objetos, Spring que é um framework que facilita a configuração de infraestruturas no desenvolvimento de aplicações Java, PostgreSQL que é um Sistema Gerenciador de Banco de Dados (SGBD), React que é utilizado para a criação da interface gráfica, Progressive Web Apps que é uma ferramenta híbrida de aplicações web, mobiles e Three.js que é uma biblioteca JavaScript/API cross-browser usada para criar e mostrar gráficos 3D animados em um navegador web. A experiência durante o desenvolvimento do software, desafios e dificuldades são descritos, apresentando as principais funções do sistema e estratégia de implantação. A construção desse projeto possibilita a formação de identidades socioculturais, disponibilizando para as pessoas a história da sociedade, através dos sítios artísticos e culturais, podendo ver as mudanças ocorridas ao passar dos anos, com um sistema interativo e com imagens em 360o.",
        "abstract": "",
        "link_acesso": "https://bdtcbra.omeka.net/items/show/512",
        "arquivo_pdf": "",
        "tipo_trabalho": "TCC"
    },
    {
        "titulo": "Software para compartilhamento de material pedagógico escolar voltado a pessoas com deficiência (PCD)",
        "autor": "Sousa, Polyana Cristina Moreira de; Fonteles, Mateus Gomes da Silva",
        "orientador": "Deus, Gustavo Henrique Dornelas de (Orient.)",
        "coorientador": "",
        "ano": "2022",
        "curso": "Tecnologia em Sistemas para Internet",
        "instituicao": "Instituto Federal de Brasília - Campus Brasília",
        "palavras_chave": "Educação; Pessoas com deficiência; Atividades adaptadas",
        "resumo": "A finalidade deste trabalho foi desenvolver uma aplicação para a internet que permita o compartilhamento de material pedagógico com foco em Pessoas com Deficiência (PCD) para educadores. O intuito é aumentar o número de visitantes mensais que acessem o conteúdo, de forma a ajudar muitos educadores e estudantes PCD, ao mesmo tempo em que aumenta a receita gerada pelos acessos ao site por meio de prospecção de usuários com propaganda patrocinada. A metodologia aplicada ́e por meio de um estudo de caso analisado que disponibiliza atividades adaptadas para a educação especial por meio de um blog existente, hospedado e mantido com a solução Blogger, oferecida pelo Google, uso de outros instrumentos de pesquisa como entrevistas regulares com a stakeholder, proprietária da solução utilizada atualmente, análise de conteúdo, etc. A análise de resultados utiliza a abordagem da engenharia de software para documentar os artefatos técnicos construídos e apresentados neste projeto, as tecnologias utilizadas para o desenvolvimento do protótipo são o framework Angular, com uso de Typescript, Javascript, HTML e CSS para a cria ̧c ̃ao do frontend, com o uso do banco de dados relacional e o Java para o backend. As experiências e desafios enfrentados durante o projeto, s ̃ao descritos, assim como, as telas com as principais funcionalidades. O desenvolvimento desse projeto permitiu aprimorar a disponibilização de materiais adaptados, proporciona o alcance a estes por outros profissionais e auxilia no desenvolvimento educacional de crianças e adultos.",
        "abstract": "",
        "link_acesso": "https://bdtcbra.omeka.net/items/show/685",
        "arquivo_pdf": "",
        "tipo_trabalho": "TCC"
    },
    {
        "titulo": "SuaConta : aplicativo para fechamento prático de contas em estabelecimentos de A&B",
        "autor": "Santana, Pedro Henrique Fernandes de; Araújo, Lucas Nascimento Verdam de",
        "orientador": "Daoud, Caio Moura (Orient.)",
        "coorientador": "",
        "ano": "2023",
        "curso": "Tecnologia em Sistemas para Internet",
        "instituicao": "Instituto Federal de Brasília - Campus Brasília",
        "palavras_chave": "Aplicativo mobile; Estabelecimentos de A&B; Sistema de gerenciamento de contas",
        "resumo": "Quando estabelecimentos do setor de Alimentos e Bebidas (A&B) não possuem um sistema de gerenciamento que organize seus processos, utilizando-se de meios manuais como cadernetas ou calculadoras para atribuir os valores a serem pagos. É comum que grupos de clientes que dividiram valores possam se deparar com implicações na hora de fechar a conta. Dessa forma, este trabalho apresenta o desenvolvimento de um aplicativo mobile, intitulado SuaConta. Criado utilizando React Native com Typescript, Express e PostgreSQL. O aplicativo conta com funcionalidades para tornar mais prático e organizado a resolução de contas pelos clientes. Mitigando possíveis erros no cálculo e atribuição dos valores. O seguinte documento apresenta detalhadamente o funcionamento e o processo de desenvolvimento do aplicativo SuaConta. Desde sua idealização, comparação com sistemas similares, metodologia, até sua implementação e publicação na loja Google PlayStore. Bem como os resultados que este projeto alcançou, que puderam ser analisados por meio da divulgação, coleta e análise dos dados de uma pesquisa de satisfação do sistema criado.",
        "abstract": "",
        "link_acesso": "https://bdtcbra.omeka.net/items/show/997",
        "arquivo_pdf": "",
        "tipo_trabalho": "TCC"
    },
    {
        "titulo": "Smart contracts: usando Blockchain",
        "autor": "Silveira, Guilherme Rodrigues da",
        "orientador": "Fustinoni, Diógenes Ferreira Reis (Orient.)",
        "coorientador": "",
        "ano": "2021",
        "curso": "Tecnologia em Sistemas para Internet",
        "instituicao": "Instituto Federal de Brasília - Campus Brasília",
        "palavras_chave": "Contrato inteligente; Blockchain; Criptografia; Ethereum",
        "resumo": "Nos últimos anos houve um aumento no interesse do mercado nas utilidades que a tecnologia Blockchain pode oferecer, especialmente por conta das criptomoedas e dos contratos inteligentes. O uso da Blockchain para execução de contratos inteligentes, apesar de menos difundido que o uso para criptomoedas, tem sido bastante discutido ultimamente. Apesar dos estudos que já existem sobre o uso da Blockchain para criação e execução de contratos inteligentes, esse estudo se propõe a apresentar o que os estudos anteriores sobre o tema apresentam relacionados às vantagens e desvantagens de usar esse tipo de contrato, bem como o que dizem sobre os principais desafios sobre a sua implementação dentro da Blockchain. Para complementar a discussão o estudo se propõe a demonstrar a implementação de um contrato inteligente, especificamente um contrato de prestação de serviço de suporte técnico em informática.",
        "abstract": "",
        "link_acesso": "https://bdtcbra.omeka.net/items/show/524",
        "arquivo_pdf": "",
        "tipo_trabalho": "TCC"
    },
    {
        "titulo": "CONDOPRO – aplicativo de gestão condominial",
        "autor": "Nascimento, Renata Domingos Manso de Oliveira",
        "orientador": "Silva, Alisson Wilker Andrade (Orient.)",
        "coorientador": "",
        "ano": "2022",
        "curso": "Tecnologia em Sistemas para Internet",
        "instituicao": "Instituto Federal de Brasília - Campus Brasília",
        "palavras_chave": "Sistema de Gestão de Condomínio; Gestão Condominial; Contratação de serviços, no-code",
        "resumo": "Este trabalho tem como principal finalidade o desenvolvimento um aplicativo mobile que realize o gerenciamento de atividades condominiais cotidianas, com foco específico na satisfação dos condôminos, ou seja, objetivando corresponder às expectativas do público-alvo. Para alcançar este objetivo, foi realizada uma pesquisa de mercado a fim de investigar os problemas da área e formular um sistema mais preciso. Após a análise dos dados coletados, foi identificada a oportunidade de criação de um aplicativo mais completo e com a funcionalidade de aquisição de serviços de profissionais particulares para os condôminos, a qual não foi vista em outros aplicativos do mesmo gênero. Em seguida, procedeu-se com o desenvolvimento, implementação e testes do sistema, utilizando-se da plataforma no-code Adalo, escolhida a partir da experiência profissional prévia da autora.",
        "abstract": "",
        "link_acesso": "https://bdtcbra.omeka.net/items/show/896",
        "arquivo_pdf": "",
        "tipo_trabalho": "TCC"
    },
    {
        "titulo": "Programação na educação básica: um estudo sobre a inserção do Scratch no Ensino Fundamental em uma escola da Rede Distrital",
        "autor": "Duarte, Larissa Alves; Silva, Marcela Gomes",
        "orientador": "Bonfim, Cristiane Jorge de Lima (Orient.)",
        "coorientador": "",
        "ano": "2021",
        "curso": "Tecnologia em Sistemas para Internet",
        "instituicao": "Instituto Federal de Brasília - Campus Brasília",
        "palavras_chave": "Pensamento computacional; Scratch; Lógica de programação; Ensino fundamental",
        "resumo": "O presente trabalho apresenta a proposta e a aplicação de uma sequência didática utilizando a plataforma Scratch para o ensino da lógica de programação e do pensamento computacional na turma de 5o ano de uma escola de Ensino Fundamental da Rede Distrital e apresentou os impactos da inserção do Pensamento Computacional neste contexto. O referencial teórico utilizado como base para pesquisa e sua aplicação, se debruçou sobre o ensino da Lógica de Programação e do pensamento computacional e os desafios para implementação na educação básica, além das ferramentas tecnológicas utilizadas. A metodologia adotada consistiu em uma revisão de bibliografia, pesquisa documental e questionário. Os resultados do projeto indicaram que o Scratch estimula a rápida aprendizagem e que é possível, por meio da lógica de programação, aprender o conteúdo de outras componentes curriculares. Com a experiência também foi possível concluir que a implementação de uma disciplina voltada ao pensamento computacional na educação básica é relevante e que tal medida pode trazer bons resultados a longo prazo, como o aprimoramento do raciocínio lógico das crianças e melhor desempenho nas demais componentes curriculares da escola .",
        "abstract": "",
        "link_acesso": "https://bdtcbra.omeka.net/items/show/426",
        "arquivo_pdf": "",
        "tipo_trabalho": "TCC"
    },
    {
        "titulo": "Classificador neural para a predição do diagnóstico clínico de hepatites virais B e C",
        "autor": "Lopes, Samuel Ferreira",
        "orientador": "Neves, Ana Regia de Mendonça (Orient.)",
        "coorientador": "",
        "ano": "2020",
        "curso": "Tecnologia em Sistemas para Internet",
        "instituicao": "Instituto Federal de Brasília - Campus Brasília",
        "palavras_chave": "Hepatite B; Hepatite C; HVB; HVC; Aprendizado de máquina; Rede neural artificial",
        "resumo": "As hepatites virais são consideradas um grande desafio de saúde pública mundial. Geralmente, o diagnóstico das hepatites virais é feito ao acaso, a partir de alterações presentes em exames de sangue. As técnicas de aprendizado de máquina estão sendo utilizadas como um método alternativo para a predição desse tipo de doença. Neste contexto, este artigo apresenta os resultados do uso de uma rede Perceptron Multicamadas para a predição do diagnóstico clínico de hepatite B e C com dados de uma base real. A metodologia aplicada passou inicialmente por uma análise exploratória dos dados, assim compreendendo cada característica do dataset, seleção dos dados que tinham uma correlação razoavelmente forte, com as características selecionadas fez-se a raspagem de dados e a limpeza e por fim foi desenvolvido o modelo e realizado os treinos e teste da Rede. Os resultados preliminares mostram uma tendência moderada na predição do diagnóstico clínico.",
        "abstract": "",
        "link_acesso": "https://bdtcbra.omeka.net/items/show/318",
        "arquivo_pdf": "",
        "tipo_trabalho": "TCC"
    },
    {
        "titulo": "Sistema de escala de serviço",
        "autor": "Pereira, Daniel Evangelista; Vale, Muller Araujo do",
        "orientador": "Daoud, Caio Moura (Orient.)",
        "coorientador": "",
        "ano": "2022",
        "curso": "Tecnologia em Sistemas para Internet",
        "instituicao": "Instituto Federal de Brasília - Campus Brasília",
        "palavras_chave": "Escala de Serviço; Gerenciamento; Automatização; Exército Brasileiro",
        "resumo": "Em diversos setores o trabalho é realizado sobre o regime de escala de serviço, que é aplicado tanto para folgas quanto para os plantões. Diversos cuidados precisam ser levados em consideração para gerar as escalas, como: O equilíbrio na distribuição das atividades; Atender restrições relacionadas a função/cargo. As inúmeras regras e restrições fazem com que o serviço de escalonar necessite de muita atenção para evitar fraude ou manipulação inadequada. É comum que as entidades utilizem um software para gerar e gerenciar as diversas escalas. No entanto, o Exército Brasileiro, que adota essa metodologia de escala de serviço, não possui nenhuma tecnologia para essa tarefa, muitas vezes o controle de escala é feito de forma manual ou utilizando planilhas eletrônicas. Nos dois casos o controle das regras é humano e passível de falha. Neste trabalho, é apresentado um software que foi desenvolvido para essa função, atendendo de forma automática as regras utilizadas no processo de escala de serviço militar e ainda registrando o log de alteração das escalas. O objetivo do trabalho é oferecer um software capaz de gerar a escala dos militares de forma automática, com segurança e equilíbrio no processo por diminuir a responsabilidade e interferência humana.",
        "abstract": "",
        "link_acesso": "https://bdtcbra.omeka.net/items/show/777",
        "arquivo_pdf": "",
        "tipo_trabalho": "TCC"
    },
    {
        "titulo": "Painel informativo de dados sobre o tratamento e a influência da terapia na doença de Parkinson",
        "autor": "Gouvea, Samuel Rodrigues; Oliveira, Lucas Freitas de",
        "orientador": "Oliveira, Fábio Henrique Monteiro (Orient.)",
        "coorientador": "",
        "ano": "2023",
        "curso": "Tecnologia em Sistemas para Internet",
        "instituicao": "Instituto Federal de Brasília - Campus Brasília",
        "palavras_chave": "Visualização de dados; Painel informativo; Doença de Parkinson; Saúde; Análise de dados",
        "resumo": "Sabe-se que a área da saúde carece da inserção tecnológica em seu meio para que ocorram melhorias contínuas nos acompanhamentos e tratamentos de pessoas acometidas por doenças neurodegenerativas. O presente trabalho busca apresentar informações emocionais de voluntários com doença de Parkinson (DP) através de painéis informativos. Essas informações são resultantes da coleta realizada por meio de escalas que avaliam o atual estado emocional de pessoas acometidas pela DP. A partir da coleta, notou-se uma necessidade de proporcionar uma visualização de dados dinâmica a fim de facilitar o acompanhamento e a condução da análise de dados pertinentes à DP. Para esse propósito construiu se um módulo, o qual apresenta 5 telas principais, que são: (I) escolha de perspectiva, (II) escolha de escalas, (III) lista de pacientes, (IV) dados gerais e (V) dados individuais. O módulo foi previamente prototipado e validado com uma especialista em avaliação da DP para analisar as preferências de visualização. O módulo foi integrado a um sistema de apresentação de dados nomeado Parkinson Dashboard. Os registros de escalas e respostas dos voluntários em cada questionário foram inseridos em uma base de dados, gerenciadas por meio do Sistema Integrado de Dados Biomédicos (SIDABI). Dessa forma, a comunicação dos painéis informativos com o SIDABI foi estruturada através de uma Application Programming Interface (API) que disponibilizou os dados devidamente tratados. Após o término do desenvolvimento, o módulo foi implantado em um ambiente em nuvem. Por fim, o projeto foi avaliado por especialistas na avaliação da DP através de um formulário com base nas heurísticas de Nielsen. O módulo obteve avaliações positivas em relação a usabilidade e a sua utilidade, mostrando ser relevante como um instrumento de apoio na avaliação da influência das emoções no tratamento da DP.",
        "abstract": "",
        "link_acesso": "https://bdtcbra.omeka.net/items/show/1012",
        "arquivo_pdf": "",
        "tipo_trabalho": "TCC"
    },
    {
        "titulo": "Contribuição dos jogos na educação: sistema de jogo educacional para auxílio de aprendizagem de língua inglesa no Ensino Médio",
        "autor": "Luciano, Brenda Caroline de Sousa",
        "orientador": "Van der Linden, Marx Gomes (Orient.)",
        "coorientador": "",
        "ano": "2022",
        "curso": "Tecnologia em Sistemas para Internet",
        "instituicao": "Instituto Federal de Brasília - Campus Brasília",
        "palavras_chave": "Jogos educacionais; Ensino; Aprendizagem; Stop; Língua inglesa",
        "resumo": "O trabalho em questão aborda as metodologias educacionais ativas a partir do uso dos jogos digitais como uma ferramenta lúdica de ensino em sala de aula, avaliando e apontando os benefícios de sua utilização, e assim, busca apresentar a proposta de desenvolvimento do jogo educacional digital English Stop, que utilizou como inspiração pedagógica o jogo popularmente conhecido como “Stop”, ou Adedonha, onde adaptou-se algumas de suas funções ao estilo próprio do jogo desenvolvido, visando a partir da sua disponibilização na plataforma Guejibo, auxiliar alunos e professores com o ensino e a aprendizagem dos verbos irregulares da língua inglesa, que são considerados complexos, afim de tornar esse processo mais prazeroso e atrativo para os alunos, a partir da abordagem interativa dos jogos.",
        "abstract": "",
        "link_acesso": "https://bdtcbra.omeka.net/items/show/627",
        "arquivo_pdf": "",
        "tipo_trabalho": "TCC"
    },
    {
        "titulo": "Sistema de administração de alunos para auxílio ao Registro Acadêmico do IFB",
        "autor": "Barroso, João Pedro de Souza; Silva, Rodrigo Dourado",
        "orientador": "Queiroz, Diego Cesar Florencio de (Orient.)",
        "coorientador": "",
        "ano": "2022",
        "curso": "Tecnologia em Sistemas para Internet",
        "instituicao": "Instituto Federal de Brasília - Campus Brasília",
        "palavras_chave": "Sistema; Processos acadêmicos; Informatização; Gestão do Registro Acadêmico; IFB",
        "resumo": "Em decorrência de todo o processo de inovação tecnológica da sociedade atualmente, em conjunto com o surgimento de inúmeras ferramentas tecnológicas voltadas a solucionar problemas cotidianos, diversas áreas do conhecimento são beneficiadas direta ou indiretamente pelo auxílio da tecnologia. Isso obviamente engloba a área acadêmica, citando como exemplo a criação de sistemas informatizados de gestão educacional que transformam e facilitam o trabalho dos profissionais alocados nessa área. Nesse contexto, a virtualização ganha força como instrumento utilizado para potencializar o uso de ambientes virtuais dentro das instituições, facilitando o rápido acesso às informações. Desse modo, este projeto propõe o desenvolvimento de um sistema desktop/web, responsável por realizar a administração dos dados dos discentes do Instituto Federal de Brasília (IFB), através da implementação de funcionalidades que compreendem, desde o cadastro de alunos e consultas sobre os mesmos, até a geração de relatórios com esses dados. Conclui-se então que a informatização desse processo de trabalho geraria diversos benefícios aos servidores do Registro Acadêmico do IFB – Campus Brasília.",
        "abstract": "",
        "link_acesso": "https://bdtcbra.omeka.net/items/show/898",
        "arquivo_pdf": "",
        "tipo_trabalho": "TCC"
    },
    {
        "titulo": "Detecção de fake news relacionadas à Covid-19 no Brasil",
        "autor": "Lucena, Francisca de Fátima de Araújo; Silva, Mariana Guedes da",
        "orientador": "Queiroz, Diego Cesar Florencio de (Orient.)",
        "coorientador": "",
        "ano": "2023",
        "curso": "Tecnologia em Sistemas para Internet",
        "instituicao": "Instituto Federal de Brasília - Campus Brasília",
        "palavras_chave": "Notícias falsas; COVID-19; Inteligência artificial; Aprendizagem de máquina; Algoritmo; Acurácia",
        "resumo": "A pandemia de corona vírus foi declara pela Organização Mundial da Saúde (OMS) em março de 2022. A veiculação de grande volume de fake news nas mídias sociais nos últimos anos, trouxe visibilidade global para a importância da observação da veracidade das informações trafegadas. O uso de ferramentas de inteligência artificial possibilita a construção de algoritmos capazes de automatizar diversos processos. O processamento de linguagem natural (PLN) é uma subárea de Ciência da Computação, inteligência artificial (IA) e linguística, que estuda os problemas da geração e compreensão da linguagem humana e que são tipicamente baseados em algoritmos de aprendizado de máquina. A aplicação de técnicas de PLN permite o processamento automático para analisar e decidir sobre o conteúdo de textos, a partir de regras de classificação estabelecidas. Este trabalho teve como objetivo desenvolver e aplicar uma ferramenta de IA capaz de analisar e classificar o conteúdo de notícias sobre COVID-19 e identificar sua veracidade. Para isso, foi construído um corpus através de uma coleta semiautomática de notícias, por meio de raspagem de dados implementada em linguagem de programação Python. Em seguida foi realizada uma análise manual para classificação das notícias, a fim de garantir que todas as notícias identificadas como falsas recebessem a marcação FAKE, bem como aquelas com conteúdo verdadeiro fosse marcadas como REAL, para treinar o algoritmo. A etapa seguinte foi o pré-processamento dos dados e extração dos atributos, por meio da biblioteca Natural Language Toolkit (NLTK) da linguagem Python 3.6. A partir da construção do corpus e do processamento dos atributos, foram construídos os conjuntos de aplicação do algoritmo, com a proporção 80/20, ou seja, 20% da amostra retida para teste e 80% dedicada ao treinamento. O processamento e classificação foram realizados utilizando a associação de TF-IDF com 3 métodos de aprendizado de maquina: Naive Bayes (NB), Random Forest (RF) e Support Vector Machine (SMV). Os resultados mostraram que o método Naive Bayes se destacou, entre os demais métodos, obtendo uma acurácia de 70%, enquanto RF e SVM obtiveram 35% e 45%, respectivamente.",
        "abstract": "",
        "link_acesso": "https://bdtcbra.omeka.net/items/show/943",
        "arquivo_pdf": "",
        "tipo_trabalho": "TCC"
    },
    {
        "titulo": "Jonathan: aplicativo de atendimento ao público em bares, lanchonetes e restaurantes",
        "autor": "Maranhão, Sarah de Aguiar; Ferreira, Guilherme Gonçalves",
        "orientador": "Deus, Gustavo Henrique Dornelas de (Orient.)",
        "coorientador": "",
        "ano": "2021",
        "curso": "Tecnologia em Sistemas para Internet",
        "instituicao": "Instituto Federal de Brasília - Campus Brasília",
        "palavras_chave": "Food service; Atendimento digital; Soluções tecnológicas",
        "resumo": "A atual situação pandêmica trouxe consigo incomensuráveis adversidades para múltiplas esferas da sociedade, dentre as quais se destaca o setor de Food Service, o qual enfrenta diversas restrições para seu funcionamento. Algumas dificuldades desse setor decorrem de longas filas para realização de pedidos que aglomeram pessoas e de dispêndio de tempo para o atendimento. À vista disso, encontram-se oportunidades para aplicabilidade de soluções tecnológicas em amparo aos protocolos e medidas de segurança determinados pelos órgãos de saúde. Além disso, a agilidade no atendimento está fortemente ligada à qualidade, sendo essa de suma importância para o consumidor, dado que um cliente insatisfeito dificilmente retorna ao estabelecimento, o que prejudica a imagem da empresa. O trabalho foi guiado pela metodologia e pesquisa Design Science Research que orienta a realização de uma pesquisa comportamental aliada à produção de um artefato. Nesse projeto propõe-se conceber um sistema de atendimento digital capaz de atender às necessidades do usuário e das empresas de Food Service no contexto atual de emergência de saúde pública de importância internacional decorrente do novo coronavírus, tornando-se viável, prático e seguro o atendimento em bares, lanchonetes e restaurantes. Dentro desse contexto, no intuito de flexibilizar o atendimento, o aplicativo Jonathan propõe gerenciamento de pedidos de forma dinâmica, além de oferecer segurança com relação à saúde dos usuários. Em síntese, o cliente tem acesso ao cardápio de maneira digitalizada, a partir do qual pode realizar seus pedidos respeitando as recomendações de prevenção a COVID-19.",
        "abstract": "",
        "link_acesso": "https://bdtcbra.omeka.net/items/show/528",
        "arquivo_pdf": "",
        "tipo_trabalho": "TCC"
    },
    {
        "titulo": "Framework de autenticação: práticas de criptografia e gerenciamento de níveis de acesso com Angular e GRAPHQL",
        "autor": "Ribeiro, Lucas Barros",
        "orientador": "Barros, Heitor José dos Santos (Orient.)",
        "coorientador": "",
        "ano": "2021",
        "curso": "Tecnologia em Sistemas para Internet",
        "instituicao": "Instituto Federal de Brasília - Campus Brasília",
        "palavras_chave": "Framework; Angular; GraphQL; PostgreSQL",
        "resumo": "O presente Trabalho de Conclusão de Curso apresenta o desenvolvimento de um framework de Autenticação, Autorização, Gerenciamento de Perfis e Níveis de Acesso, que são requisitos frequentemente demandados no desenvolvimento de aplicações Web. Desta forma, o desenvolvimento do framework proposto neste trabalho visa aumentar a eficiência no desenvolvimento destas aplicações. Além disso, para garantir a segurança das aplicações e performance no desenvolvimento de sistemas, este trabalho adota métodos, técnicas e boas práticas para o desenvolvimento de sistemas, a fim de promover a reusabilidade e maturidade em equipes de desenvolvimento, entregando um framework composto por um modelo de bancos de dados, uma API GraphQL e uma aplicação Angular.",
        "abstract": "",
        "link_acesso": "https://bdtcbra.omeka.net/items/show/427",
        "arquivo_pdf": "",
        "tipo_trabalho": "TCC"
    },
    {
        "titulo": "Preço camarada: uma aplicação progressiva para divulgação de produtos e serviços",
        "autor": "Lima, Carlos Eduardo Alves de; Lima, Franklin Hudson Oliveira",
        "orientador": "Silva, Alisson Wilker Andrade (Orient.)",
        "coorientador": "",
        "ano": "2020",
        "curso": "Tecnologia em Sistemas para Internet",
        "instituicao": "Instituto Federal de Brasília - Campus Brasília",
        "palavras_chave": "Marketing digital; Node.js; Vue.js; PWA",
        "resumo": "Este trabalho apresenta um estudo sobre a ambiente web e o processo de desenvolvimento da aplicação progressiva Preço Camarada. O escopo da aplicação é fornecer um meio para que estabelecimentos divulguem seus produtos e serviços para potenciais consumidores. Será abordado a necessidade de sua implementação, as tecnologias e metodologias utilizadas no seu desenvolvimento, suas funcionalidades e o resultado do projeto.",
        "abstract": "",
        "link_acesso": "https://bdtcbra.omeka.net/items/show/444",
        "arquivo_pdf": "",
        "tipo_trabalho": "TCC"
    },
    {
        "titulo": "Sistema web para auxílio no processo de confecção de roupas",
        "autor": "Dias, Glaucia Maria Borges",
        "orientador": "Barros, Heitor José Dos Santos (Orient.)",
        "coorientador": "",
        "ano": "2023",
        "curso": "Tecnologia em Sistemas para Internet",
        "instituicao": "Instituto Federal de Brasília - Campus Brasília",
        "palavras_chave": "Costureira; Roupa; Moda; Sistema web",
        "resumo": "O sistema web desenvolvido no decorrer desse trabalho, construído com as tecnologias HTML, CSS e JavaScript, apresenta funcionalidades que permitem calcular a metragem necessária de tecido para confeccionar uma peça de roupa de acordo com os valores fornecidos pelo usuário. Desse modo, o sistema realiza os cálculos utilizando as medidas de comprimento, tamanho e a quantidade de peças a serem produzidas. Na comparação com os sistemas similares, apesar do fato de os sistemas realizarem cálculos, o sistema apresentado exibe uma abordagem onde os cálculos são focados em roupas. Em termos de continuidade futura, sugere-se a criação de funcionalidades como cálculos de custo da peça de roupa, controle de estoque dos materiais utilizados na confecção de vestuário e registro do andamento dos projetos de costura.",
        "abstract": "",
        "link_acesso": "https://bdtcbra.omeka.net/items/show/1004",
        "arquivo_pdf": "",
        "tipo_trabalho": "TCC"
    },
    {
        "titulo": "Criação de um jogo para o aprendizado de programação",
        "autor": "Alencar, Matheus Monteiro Rodrigues",
        "orientador": "Van der Linden, Marx Gomes (Orient.)",
        "coorientador": "",
        "ano": "2021",
        "curso": "Tecnologia em Sistemas para Internet",
        "instituicao": "Instituto Federal de Brasília - Campus Brasília",
        "palavras_chave": "Jogo; Aprendizado; Programação",
        "resumo": "O uso da lógica de jogos para o aprendizado é uma atividade cada vez mais comum e com grande efetividade quando bem aplicada, este trabalho busca desenvolver um sistema que utilize esta lógica para ajudar estudantes que estejam iniciando o aprendizado de programação, com o objetivo de auxiliá-los e reduzir a taxa de reprovações e evasão dos cursos da área.",
        "abstract": "",
        "link_acesso": "https://bdtcbra.omeka.net/items/show/456",
        "arquivo_pdf": "",
        "tipo_trabalho": "TCC"
    },
    {
        "titulo": "Fabbrini: aplicação web para autotriagem",
        "autor": "Rosa, Matheus Kaúlly dos Santos; Araújo, Pedro Miguel Ribeiro",
        "orientador": "Segato, Tiago Henrique Faccio (Orient.)",
        "coorientador": "",
        "ano": "2021",
        "curso": "Tecnologia em Sistemas para Internet",
        "instituicao": "Instituto Federal de Brasília - Campus Brasília",
        "palavras_chave": "Aplicação web; Saúde; Autotriagem; Tecnologia",
        "resumo": "Nota-se que, no momento atual, por conta de problemas vivenciados nos centros de saúde, como o excesso de tempo de espera e a baixa quantidade de agentes para atendimento, uma expansão da triagem hospitalar convencional para a teletriagem e autotriagem está em decorrência, visto que, o uso da tecnologia cresce de forma abundante na área da saúde. Deste modo, este trabalho apresenta o desenvolvimento de uma aplicação web para autotriagem, com o propósito de classificar o grau de risco de um paciente por meio de tecnologias que funcionam em navegadores. A construção do sistema é baseada em estudos da literatura acerca da triagem e suas ramificações, da motivação e das tecnologias utilizadas, como a linguagem de programação Javascript e seus frameworks. A aplicação apresentada foi desenvolvida e testada por um profissional de tecnologia e pelo demandante da aplicação, a fim de verificar o funcionamento e a viabilidade do software. A partir dos resultados acerca dos testes, podemos concluir que a aplicação ficou satisfatória, mostrando que há benefícios na utilização da mesma, deixando de forma automática, o processo da classificação de risco, diminuindo o tempo de espera e liberando profissionais que atuam na triagem para outras atividades.",
        "abstract": "",
        "link_acesso": "https://bdtcbra.omeka.net/items/show/534",
        "arquivo_pdf": "",
        "tipo_trabalho": "TCC"
    },
    {
        "titulo": "Abordagem de Ciência de Dados Sobre os Dados Fisiológicos de Indivíduos com a doença de Parkinson Durante o Jogo Sério RehaBEElitation",
        "autor": "Plá, Pedro Braga",
        "orientador": "Oliveira, Fábio Henrique Monteiro (Orient.)",
        "coorientador": "",
        "ano": "2023",
        "curso": "Tecnologia em Sistemas para Internet",
        "instituicao": "Instituto Federal de Brasília - Campus Brasília",
        "palavras_chave": "Doença de Parkinson; Ciência de dados; Acompanhamento; Diagnóstico; Progressão; Jogo sério; RehaBEElitation",
        "resumo": "Este trabalho busca caracterizar a doença de Parkinson analisando os dados vindos da aplicação do jogo sério RehaBEElitation, que colheu dados de telemetria de seus trinta jogadores voluntários - quinze pessoas hígidas do grupo de controle e quinze pessoas com DP. Através da análise dos dados coletados, foram verificados e mensurados diferentes efeitos da DP sobre os sinais biométricos de impedância da pele e frequência cardíaca coletados durante o jogo, foram também criadas visualizações dos dados para melhor elucidar o efeito da DP sobre a resposta dos participantes à atividade, bem como verificar o efeito do reforço positivo administrado durante as sessões para estes sinais coletados. Foram verificados maiores valores de frequência cardíaca para o grupo de participantes com PD, e uma queda da frequência cardíaca com a presença de reforço positivo durante o jogo. Observando a impedância da pele, foi observado uma queda nos valores de GSR com a presença de reforço positivo para o grupo com PD.",
        "abstract": "",
        "link_acesso": "https://bdtcbra.omeka.net/items/show/912",
        "arquivo_pdf": "",
        "tipo_trabalho": "TCC"
    },
    {
        "titulo": "Mineração e processamento de informações epidemiológicas no contexto da Sociedade Brasileira de Queimaduras",
        "autor": "Viana, Josué de Paulo; Inácio, José Rodrigo da Silva",
        "orientador": "Fernandez, Fábio Ferraz (Orient.)",
        "coorientador": "",
        "ano": "2022",
        "curso": "Tecnologia em Sistemas para Internet",
        "instituicao": "Instituto Federal de Brasília - Campus Brasília",
        "palavras_chave": "Big data; Epidemiologia; Saúde; Processamento de dados",
        "resumo": "Com a quantidade de dados disponíveis na ‘internet’ em aumentando diariamente, ferramentas que possam fazer a coleta e analise se tornam mais necessárias. Na área de saúde, o Governo Federal disponibilizou o DATASUS e OpenDATASUS que têm como objetivo a coleta e armazenamento de dados em um conjunto de bases para fácil acesso, entretanto, o tratamento desses registros é algo que não é feito nos sistemas fornecidos pelo órgão —TABWIN e TABNET. Ferramentas de auxílio a análise de informações epidemiológicas tornam-se necessárias para que pesquisas e artigos possam ser realizados de forma ágil, pois, o tratamento manual pode ser um problema devido à quantidade de registros, e a formatação do sistema DATASUS, que eleva o tempo gasto para extrair informações uteis. O seguinte trabalho tem como objetivo desenvolver um sistema que possa auxiliar os pesquisadores da Sociedade Brasileira de Queimaduras no levantamento de informações relevantes a partir de grandes quantidades de dados brutos. São contextualizados tópicos que servem como referencial teórico, assim como as tecnologias usadas e o processo de desenvolvimento. O objetivo é então alcançado pela criação de um sistema de processamento, emissão e armazenamento de relatórios, que busca agilizar e facilitar o processo de levantamento de informações durante pesquisas epidemiológicas.",
        "abstract": "",
        "link_acesso": "https://bdtcbra.omeka.net/items/show/669",
        "arquivo_pdf": "",
        "tipo_trabalho": "TCC"
    },
    {
        "titulo": "Sistema de publicação de informações mantidas por comissão em uma Instituição de ensino técnico federal",
        "autor": "Franco, Claudio Lucas de Oliveira; Rocha, Danilo Silva Santos",
        "orientador": "Deus, Gustavo Henrique Dornelas de (Orient.)",
        "coorientador": "",
        "ano": "2023",
        "curso": "Tecnologia em Sistemas para Internet",
        "instituicao": "Instituto Federal de Brasília - Campus Brasília",
        "palavras_chave": "Processos de negócios; Instituto Federal de Educação, Ciência e Tecnologia; Publicitação de informações; Acesso à informação",
        "resumo": "Este trabalho tem como objetivo o desenvolvimento de um sistema para publicitação de informações e arquivos elaborados e mantidos por uma comissão de mapeamento de processos de negócios em um instituto federal de ensino cuja implementação possibilite acesso aos documentos postados pela comunidade de alunos, professores e demais interessados. A revisão de literatura aborda o acesso à informação no Brasil e nos Institutos Federais de Ensino, discorre sobre o compartilhamento digital de informações e apresenta projetos similares ao desenvolvido deste trabalho. A metodologia aplicada é por meio do estudo de caso que teve como instrumentos de pesquisa a análise de conteúdo, observação assistemática e entrevista semiestruturada com um membro da comissão para a elaboração de uma proposta de solução tecnológica que atendesse as expectativas das partes interessadas. A análise de resultados utiliza a abordagem da engenharia de software para direcionar a construção de alguns dos artefatos técnicos construídos como o diagrama e as especificações de casos de uso. As tecnologias utilizadas para o desenvolvimento do sistema foram o React JS, Typescript, Firebase e o Cloud Firestore para o gerenciamento de dados. O processo de desenvolvimento do sistema foi descrito contendo os desafios e soluções encontradas, além da descrição das funcionalidades do software. A realização desse projeto pode contribuir para facilitar a divulgação e acesso às informações oriundas de uma instituição de ensino federal.",
        "abstract": "",
        "link_acesso": "https://bdtcbra.omeka.net/items/show/893",
        "arquivo_pdf": "",
        "tipo_trabalho": "TCC"
    },
    {
        "titulo": "Ambiente Web para a execução segura de código nativo",
        "autor": "Flausino, Caio Gomes Flausino",
        "orientador": "Queiroz, Diego Cesar Florencio de (Orient.); Lima, Daniel Sundfeld (Coorient.)",
        "coorientador": "",
        "ano": "2022",
        "curso": "Tecnologia em Sistemas para Internet",
        "instituicao": "Instituto Federal de Brasília - Campus Brasília",
        "palavras_chave": "API; WebAssembly; Código nativo; Segurança; Linux; Contêiner",
        "resumo": "Performance e segurança em aplicações web têm sido alvo de grande discussão e, dessa forma, durante os anos surgiram diferentes soluções para a execução segura de binários nativos. No entanto, foi só recentemente que o kernel Linux adotou uma série de recursos capazes de insolar e restringir qualquer tipo de processo que esteja sendo executado na máquina, permitindo assim a criação de um ambiente isolado do restante do sistema sem o uso de virtualização de hardware. Outro problema é como estabelecer um meio de comunicação entre os processos executados no navegador e os executados diretamente no sistema operacional, mas, ambos os códigos possuem acesso à pilha de rede. Este trabalho visa por meio de uma prova de conceito, compreender se contêineres podem servir como alternativa de ambiente de execução na web, substituindo talvez o WebAssembly. Dessa maneira, foi desenvolvido um software de conteinerização otimizado e que aplicasse a maioria dos mecanismos de segurança do Linux, juntamente com uma página de protótipo para demonstrar seu funcionamento. Em seguida comparou-se o desempenho desse ambiente com o WebAssembly dos navegadores Chrome, Chromium e Firefox. Os resultados mostraram o WebAssembly sendo mais rápido que o contêineres com SECCOMP, e ainda assim suportando muitos recursos de segurança semelhantes, deixando evidente que contêineres não foram capazes de servir como alternativa web para a execução de código nativo.",
        "abstract": "",
        "link_acesso": "https://bdtcbra.omeka.net/items/show/774",
        "arquivo_pdf": "",
        "tipo_trabalho": "TCC"
    },
    {
        "titulo": "Desenvolvimento de ferramenta de chatbot como solução para a comunicação do IFB",
        "autor": "Silva, Katlen Karine Costa; Tierno, Rodrigo Ortega",
        "orientador": "Oliveira, Fábio Henrique Monteiro (Orient.)",
        "coorientador": "",
        "ano": "2021",
        "curso": "Tecnologia em Sistemas para Internet",
        "instituicao": "Instituto Federal de Brasília - Campus Brasília",
        "palavras_chave": "Chatbot; Comunicação; Web scraping; Automação; Instituição de ensino",
        "resumo": "Hoje o Instituto Federal de Brasília tem enfrentado dificuldade para uma comunicação mais ativa. Por meio de pesquisa, foi identificada a situação em que grande parte dos estudantes da instituição informa que já perdeu oportunidades por não ter acesso à notícias em tempo. Um chatbot é um sistema de conversação construído para interagir com usuários processando linguagem natural. Existem chatbots que são baseados em regras e baseados em inteligência artificial. Neste trabalho foi desenvolvido um chatbot baseado em regras a fim de otimizar a forma como os estudantes do IFB acessam às informações e notícias do portal oficial. Para isso foi feito o levantamento bibliográfico de estudos similares que auxiliou no desenvolvimento do sistema proposto, dando parâmetros de funcionalidades em diferentes contextos e de ferramentas que poderiam ser utilizadas na sua construção. Também foi feita uma pesquisa amostral com o público alvo tratando do problema, e outra a fim de avaliar a solução já implementada para a fase de testes e melhorias.",
        "abstract": "",
        "link_acesso": "https://bdtcbra.omeka.net/items/show/437",
        "arquivo_pdf": "",
        "tipo_trabalho": "TCC"
    },
    {
        "titulo": "Centrífuga de laboratório inteligente de baixo custo",
        "autor": "Santos, Érika da Silva; Cardoso, Diego Erick do Carmo",
        "orientador": "Daoud, Caio Moura (Orient.)",
        "coorientador": "",
        "ano": "2023",
        "curso": "Tecnologia em Sistemas para Internet",
        "instituicao": "Instituto Federal de Brasília - Campus Brasília",
        "palavras_chave": "Centrífuga; Automação; Impressora 3D; Arduino; Sensoriamento",
        "resumo": "Uma centrífuga é um dispositivo que usa a força centrífuga para apartar os componentes de uma mistura com base em sua densidade (NAVARRO, 2020), ou seja, é um equipamento muito importante para separar e purificar uma ampla gama de amostras, como sangue, urina, produtos químicos e proteínas. Pode ser encontrado em indústrias e instituições de ensino na área da saúde. No entanto, existem dois fatores que fazem com que muitas instituições não tenham acesso a essa tecnologia. Em primeiro lugar, o alto custo do equipamento, em segundo lugar, a dificuldade de transporte do equipamento comercializado. Outro ponto relevante está relacionado com a segurança de utilização, que normalmente depende apenas da percepção e habilidade dos usuários. Essa questão de segurança também é relevante nos equipamentos desenvolvidos com material de baixo custo que tem objetivo de tornar a centrífuga mais acessível. Focando em minimizar os riscos de utilização deste equipamento. Nesse sentido, este trabalho propõe a utilização de sensores e Arduino para monitorar o funcionamento das centrífugas, alertar o funcionamento indevido e assim reduzir o risco de acidentes, prolongando a vida útil do equipamento.",
        "abstract": "",
        "link_acesso": "https://bdtcbra.omeka.net/items/show/999",
        "arquivo_pdf": "",
        "tipo_trabalho": "TCC"
    },
    {
        "titulo": "Sistema Web para facilitar na divulgação de animais perdidos: DivuPets - divulgação de animais de estimação",
        "autor": "Alves, Maria da Conceição Romeiro; Santos, Vinicius da Costa",
        "orientador": "Oliveira, Kadidja Valeria Reginaldo de (Orient.)",
        "coorientador": "",
        "ano": "2022",
        "curso": "Tecnologia em Sistemas para Internet",
        "instituicao": "Instituto Federal de Brasília - Campus Brasília",
        "palavras_chave": "Linguagem de programação; Base de dados; Proteção e cuidado com animais",
        "resumo": "Encontrar um animal desaparecido não é uma tarefa fácil e na maior parte dos casos a busca ainda envolve uma comunicação boca a boca, panfletagem ou divulgação em redes sociais. Nesse cenário, a espera de telefonemas ou mensagens que possam trazer qualquer novidade sobre o paradeiro do animal desaparecido é angustiante. À vista disso, e com a finalidade de ajudar nessa busca e se tornar mais um meio para que as pessoas possam recorrer, o presente trabalho tem como objetivo apresentar um sistema desenvolvido para a Web, de fácil utilização, construído com a linguagem de programação PHP, para auxiliar na divulgação de animais perdidos.",
        "abstract": "",
        "link_acesso": "https://bdtcbra.omeka.net/items/show/779",
        "arquivo_pdf": "",
        "tipo_trabalho": "TCC"
    },
    {
        "titulo": "Chatbot para entrevista de emprego",
        "autor": "Silva, Douglas Feliphe Camargos da; Freire, Deise",
        "orientador": "Rabelo, Hially Santos (Orient.)",
        "coorientador": "",
        "ano": "2022",
        "curso": "Tecnologia em Sistemas para Internet",
        "instituicao": "Instituto Federal de Brasília - Campus Brasília",
        "palavras_chave": "Chatbot; Assistente virtual; Entrevista; Recursos Humanos",
        "resumo": "O trabalho “Chatbot para entrevista de emprego” faz uma exposição inicial sobre o que é chatbot e como está ocorrendo o crescimento desse mercado, bem como demonstra como o departamento de recursos humanos trabalha para recrutar e selecionar candidatos a empregos e as dificuldades de um recrutador em entrevistar presencialmente seus candidatos. Como método de pesquisa, foi aplicado o Design Science Research, a linguagem escolhida para desenvolver o chatbot foi o Python utilizando a (Application Programming Interface - API) do Telegram. Assim, este trabalho tem como objetivo desenvolver um software, com interface de chatbot, para ser utilizado por recrutadores para ajudar no processo de entrevista. O trabalho também corrobora com as etapas de desenvolvimento de um chatbot, desde a criação, desenvolvimento, testes e validação da versão final. Foi verificado com esse trabalho que é possível o desenvolvimento de um chatbot para entrevista, utilizando ferramentas simples e intuitivas. Por fim, foi concluído que, a partir desse resultado, a implementação de um chatbot poderá impactar positivamente na ampliação das entrevistas por parte dos recrutadores.",
        "abstract": "",
        "link_acesso": "https://bdtcbra.omeka.net/items/show/700",
        "arquivo_pdf": "",
        "tipo_trabalho": "TCC"
    },
    {
        "titulo": "Propondo operações e processos baseados em princípios éticos para prevenir, identificar e corrigir sistemas de reconhecimento facial enviesados",
        "autor": "Trindade, Jorge Kayodê Lima",
        "orientador": "Oliveira, Fábio Henrique Monteiro (Orient.); Ramos, Rodrigo (Coorient.)",
        "coorientador": "",
        "ano": "2023",
        "curso": "Tecnologia em Sistemas para Internet",
        "instituicao": "Instituto Federal de Brasília - Campus Brasília",
        "palavras_chave": "Racismo algorítmico; Guia de desenvolvimento; Inteligência artificial; Ética; Reconhecimento facial",
        "resumo": "O desenvolvimento de sistemas de Inteligência Artifical modernos, ao longo dos anos, está sendo marcado por uma série de tendências que acarretam a discriminação de vários grupos étnicos-raciais minorizados, através do funcionamento de tecnologias que utilizam técnicas de aprendizado de máquina para realizar a classificação e previsão sobre os dados dos usuários de diversas origens. A literatura descreve o racismo algorítmico como um problema mundial que afeta grupos populacionais minorizados em diversas situações de vulnerabilidade em razão de sua raça e etnia, e por esta razão é considerado um dos diversos sintomas das várias formas de racismo estrutural. Através desse trabalho, está sendo proposto um guia com operações e processos a serem utilizados para direcionar o desenvolvimento de sistemas de inteligência artificial e aprendizado de máquina, usando sistemas de reconhecimento facial como base e referência. Para fundamentar essas novas práticas, visita-se a área da ética e da epistemologia seguindo uma abordagem quanti-quali, a fim de prover definições e novos processos, indicadores e operações para evidenciar a transparência, a explicabilidade e a confiabilidade desses sistemas. Enquanto há diversos estudos que demonstram a baixa eficiência de guias como esse em reduzir o nível e número de sistemas de IA enviesados, aqui está sendo apresentado como resultado técnicas que partem da etapa do tratamento dos dados até o cálculo das métricas que representam a capacidade de um sistema de servir usuários que partem de diferentes populações do mundo todo. É possível concluir que há ações a serem feitas em cada etapa do desenvolvimento de um sistema de IA: Ao prevenir, se realiza o planejamento e alinhamento do desenho do sistema com os critérios e indicadores que podem direcionar o desenvolvimento do sistema para que não seja enviesado; para identificar, e submete um sistema á auditoria ou á um sistema de monitoramento para entender as alterações e impactos que esses sistemas causam, e estão sendo sujeitos ao longo do tempo; e para corrigir, se busca aplicar o resultado dessa auditoria à revisão do sistema, ou buscar por técnicas que possam responder a esse viés que está discriminando o funcionamento desse sistema entre as diversas classes de um conjunto de dados, a partir dos sinais que serão evidenciados nas métricas desse sistema.",
        "abstract": "",
        "link_acesso": "https://bdtcbra.omeka.net/items/show/1055",
        "arquivo_pdf": "",
        "tipo_trabalho": "TCC"
    },
    {
        "titulo": "Ferramenta de desenvolvimento de software na web para aprendizagem de algoritmos",
        "autor": "Teixeira, Neander Wendel Nobre",
        "orientador": "Silva, Alisson Wilker Andrade (Orient.)",
        "coorientador": "",
        "ano": "2020",
        "curso": "Tecnologia em Sistemas para Internet",
        "instituicao": "Instituto Federal de Brasília - Campus Brasília",
        "palavras_chave": "Algoritmo; Programação; Desenvolvimento de sistemas; Ferramentas Web 2.0",
        "resumo": "Este documento apresentará informações sobre ferramentas de desenvolvimento de softwares na internet, que poderão auxiliar instrutores e estudantes que estão ingressando na área de desenvolvimento de sistemas. Também será apresentado sobre alguns problemas existentes nesse período inicial e como eles afetam os alunos. O documento também mostrará algumas das dificuldades dos instrutores ao lecionar para esses alunos. Ao final, será proposto uma ferramenta gratuita que ajudará os instrutores com um ambiente único para atividades, com avaliação automática e apresentação de dados. Para os estudantes, será disponibilizado um ambiente totalmente gratuito em que ele possa desenvolver algoritmos livremente. Também serão apresentadas ferramentas existentes com seus pontos positivos e negativos. Mostrará também comparações entre essas ferramentas e quais as melhores escolhas para o instrutor.",
        "abstract": "",
        "link_acesso": "https://bdtcbra.omeka.net/items/show/425",
        "arquivo_pdf": "",
        "tipo_trabalho": "TCC"
    },
    {
        "titulo": "Implementação da proposta de um documento de identidade seguro de baixo custo",
        "autor": "Mendonça, Carlos Victor da Silva",
        "orientador": "Fustinoni, Diógenes Ferreira Reis (Orient.)",
        "coorientador": "",
        "ano": "2023",
        "curso": "Tecnologia em Sistemas para Internet",
        "instituicao": "Instituto Federal de Brasília - Campus Brasília",
        "palavras_chave": "Documento; Identificação pessoal eletrônica; Criptografia; Qr-Code",
        "resumo": "A utilização do documento de identificação pessoal garante a individualização dos cidadãos perante o Estado. A realização de estudos que possuam o objetivo de minimizar riscos que atentem contra a identidade civil individual são extremamente necessários. Os atuais avanços tecnológicos mundiais permitem que diversos tipos de recursos sejam empregados contra a existência de problemas relacionados à falsidade ideológica. A utilização de Electronic Identity Document (eID) é um mecanismo com boas respostas frente ao referido problema, e seu uso vem crescendo significativamente ao longo dos últimos anos em países com elevado potencial tecnológico, principalmente na Europa. Nesse sentido, o presente trabalho objetiva assegurar a inalterabilidade dos dados pessoais inscritos sob o documento de identificação individual, por meio da implementação de um Qr Code com tecnologias criptográficas que conterão os dados pessoais do cidadão, de forma que seu custo seja reduzido e que o documento de identidade seja seguro.",
        "abstract": "",
        "link_acesso": "https://bdtcbra.omeka.net/items/show/885",
        "arquivo_pdf": "",
        "tipo_trabalho": "TCC"
    },
    {
        "titulo": "Desenvolvimento de um jogo para simulação de gestão de tecnologia",
        "autor": "Romero, Marcus Vinicius da Silva",
        "orientador": "Van Der Linden, Marx Gomes (Orient.)",
        "coorientador": "",
        "ano": "2022",
        "curso": "Tecnologia em Sistemas para Internet",
        "instituicao": "Instituto Federal de Brasília - Campus Brasília",
        "palavras_chave": "Gestão de Tecnologia da Informação; Jogos eletrônicos; Jogos educativos; Jogos web",
        "resumo": "Há muito tempo que os jogos eletrônicos deixaram de ser brinquedo de criança para se tornar uma grande indústria de entretenimento, e a cada ano atingem um número maior de usuários e plataformas. Mas jogos em aparelhos celulares, a não ser pelo iPhone da Apple, nunca chegaram a fazer sucesso. Por isso o jogo será com ênfase na web, visando atingir um público maior, já que, mesmo os aparelhos mais simples de hoje possuem recursos suficientes para esse tipo de jogos, são dispositivos populares e de uso diário, o que os torna uma plataforma em potencial. Nesse trabalho será feita o desenvolvimento de um jogo educativo e revisão do contexto atual do mercado de trabalho, o projeto e implementação do jogo para auxiliar alunos e profissionais interessados em gestão de TI.",
        "abstract": "",
        "link_acesso": "https://bdtcbra.omeka.net/items/show/778",
        "arquivo_pdf": "",
        "tipo_trabalho": "TCC"
    },
    {
        "titulo": "Sistema web de gerenciamento de pontos de entulhos",
        "autor": "Bezerra, Adjair Nascimento; Oliveira, Rafael da Silva",
        "orientador": "Linden, Marx Gomes Van Der (orient.)",
        "coorientador": "",
        "ano": "2021",
        "curso": "Tecnologia em Sistemas para Internet",
        "instituicao": "Instituto Federal de Brasília - Campus Brasília",
        "palavras_chave": "Sistema web - desktop; Leaflet; Coleta de entulho; Padrão MVC",
        "resumo": "Além de crime ambiental Art. 54 da Lei de Crimes Ambientais, o cidadão que faz o descarte inadequado de lixo ou entulho em estradas, rodovias ou no meio ambiente, está também colocando a saúde pública em risco. O objetivo central do trabalho é o desenvolvimento de um sistema web/desktop para gerenciar pontos de entulhos não autorizados a princípio para o uso nas cidades do Distrito Federal, que foi desenvolvido com as linguagens de programação PHP e o alojamento de localização Leaflet, que é uma biblioteca de código aberto desenvolvido em JavaScript, utilizando-se o PadrãoMVC (Model, viewe controller) onde ocorre uma facilidade de troca de informações entre a interface do usuário aos dados no banco de dados fazendo com que as respostas sejam rápidas e dinâmicas. Nesse sentido, foram utilizados sites e artigos relacionados a sistemas de coleta de entulho como base de desenvolvimento, além da realização de uma pesquisa exploratória de modo a investigar o problema e formular uma hipótese mais precisa. Desse modo, com a disponibilização do sistema, espera-se uma melhoria na qualidade de vida da população que acaba sendo afetada pelo descarte inadequado de tal resíduo.",
        "abstract": "",
        "link_acesso": "https://bdtcbra.omeka.net/items/show/1059",
        "arquivo_pdf": "",
        "tipo_trabalho": "TCC"
    },
    {
        "titulo": "ANAMNABOT: utilização de chatbot para anamnese em consultas médicas de pacientes com a doença de Parkinson",
        "autor": "Camargos, Paloma Gina de; Silva, Paulo Henrique Ribeiro da",
        "orientador": "Segato, Tiago Henrique Faccio (Orient.); Oliveira, Fábio Henrique Monteiro (Coorient.)",
        "coorientador": "",
        "ano": "2023",
        "curso": "Tecnologia em Sistemas para Internet",
        "instituicao": "Instituto Federal de Brasília - Campus Brasília",
        "palavras_chave": "Anamnese; Chatbot; Automatização; Consultas médicas; Parkinson",
        "resumo": "Passar por consultas médicas faz parte da vida das pessoas, de forma periódica e, independente do motivo, é de extrema importância a realização de uma boa anamnese para conseguir identificar e tratar as queixas de maneira mais eficiente. No caso da Doença de Parkinson (DP), esse processo torna-se ainda mais crucial, uma vez que um diagnóstico precoce e uma abordagem cuidadosa são essenciais para gerenciar eficazmente os sintomas e melhorar a qualidade de vida do paciente. Dada a importância da anamnese, é fundamental que a coleta de informações seja completa para direcionar o tratamento mais adequado. Contudo, diante de situações como a intensa carga de trabalho e as limitações de tempo enfrentadas pelos profissionais de saúde, surgem desafios consideráveis no dia a dia dessa área. Essas circunstâncias podem levar a procedimentos automatizados e à falta de atenção adequada. Dessa forma, considerando tais problemas, se faz necessário a utilização da tecnologia, a fim de auxiliar os médicos na automatização de processos e até mesmo na tomada de decisão. Nesta linha, esse projeto objetiva a criação e uso do AnamnaBot (chatbot), que possa auxiliar na realização da anamnese no âmbito da DP, diretamente com o paciente, de maneira antecipada a entrada no consultório médico, com o intuito de evitar a omissão de informações, que possam ser crucias para um diagnóstico correto. Após a realização dos estudos essenciais para viabilizar o projeto, por meio da modelagem e tecnologias utilizadas, foi realizado a criação e devidas configurações do chatbot, com isso, os resultados indicam uma resposta positiva às questões abordadas na condução da anamnese. Esses resultados foram aprovados pela especialista em Parkinson do projeto, a Dra. Luiza Maire David Luiz.",
        "abstract": "",
        "link_acesso": "https://bdtcbra.omeka.net/items/show/1057",
        "arquivo_pdf": "",
        "tipo_trabalho": "TCC"
    },
    {
        "titulo": "Gerenciamento e armazenamento de dados de sensores para a avaliação da doença de Parkinson: uma revisão",
        "autor": "Candeira, Daniel Barros",
        "orientador": "Oliveira, Fábio Henrique Monteiro (Orient.)",
        "coorientador": "",
        "ano": "2020",
        "curso": "Tecnologia em Sistemas para Internet",
        "instituicao": "Instituto Federal de Brasília - Campus Brasília",
        "palavras_chave": "Doença neurodegenerativa; Doença de Parkinson; Qualidade de vida; Serviços remotos de monitoramento de saúde; Sensores",
        "resumo": "O aumento da expectativa de vida da população levou, entre outros aspectos, ao crescimento da ocorrência de doenças neurodegenerativas, como a doença de Parkinson (DP). Nesse sentido, com o objetivo de melhorar a qualidade de vida da população, os serviços remotos de monitoramento de saúde habilitados com sensores estão se tornando mais comuns. No entanto, ainda existem desafios quanto ao gerenciamento e armazenamento das grandes quantidades dos dados coletados por esses sensores. A fim abordar soluções para os desafios citados anteriormente, neste artigo é feita uma revisão sistemática de literatura. Através dos resultados obtidos, observou-se uma baixa quantidade de artigos com detalhes específicos sobre o tema.",
        "abstract": "",
        "link_acesso": "https://bdtcbra.omeka.net/items/show/347",
        "arquivo_pdf": "",
        "tipo_trabalho": "TCC"
    },
    {
        "titulo": "Jogo educacional de associação de conceitos",
        "autor": "Reis, Antoni Eduardo Caetano dos; Neres, Prince",
        "orientador": "Linden, Marx Gomes Van Der (Orient.)",
        "coorientador": "",
        "ano": "2023",
        "curso": "Tecnologia em Sistemas para Internet",
        "instituicao": "Instituto Federal de Brasília - Campus Brasília",
        "palavras_chave": "Jogo Educacional; Ensino; Tecnologia; Aprendizado",
        "resumo": "O grande avanço tecnológico sobreposto ao grande tradicionalismo do ensino nas salas de aula tem feito com que docentes busquem novas formas de ensino utilizando-se das novas e diversas ferramentas tecnológicas disponíveis. Este trabalho visa contribuir com a melhoria do ensino e aprendizado no ensino fundamental. O foco deste trabalho está no desenvolvimento de um jogo digital educacional para web, que auxilia no processo de aprendizagem em escolas, possibilitando o engajamento dos alunos e proporcionando o aprendizado de forma lúdica no ambiente escolar, com o diferencial do docente poder trabalhar com vários temas e conteúdos diferentes dentro da aplicação com seus alunos, através de uma mecânica de arrastar itens para a respectiva categoria correta. A metodologia empregada no trabalho consistiu em duas etapas, uma pesquisa bibliográfica sobre educação atrelada à tecnologia e o desenvolvimento do software. Como resultado, espera-se que o software desenvolvido neste trabalho contribua positivamente nos processos de ensino e aprendizagem para alunos do ensino fundamental, sendo oferecido como alternativa para dinamizar as aulas predominantemente tradicionalistas utilizadas nas diversas instituições de ensino brasileiras.",
        "abstract": "",
        "link_acesso": "https://bdtcbra.omeka.net/items/show/897",
        "arquivo_pdf": "",
        "tipo_trabalho": "TCC"
    },
    {
        "titulo": "Ergonomission - software para prevenção de lesões por uso extensivos de dispositivos eletrônicos",
        "autor": "Nascimento, Nikolle de Lacerda; Frausino, Tiago Civatti",
        "orientador": "Mendes, Hugo do Carmo (Orient.); Oliveira, Fábio Henrique Monteiro (Coorient.)",
        "coorientador": "",
        "ano": "2022",
        "curso": "Tecnologia em Sistemas para Internet",
        "instituicao": "Instituto Federal de Brasília - Campus Brasília",
        "palavras_chave": "Ergonomia; Saúde; Home Office; Ensino Remoto; Prevenção de LER",
        "resumo": "Diante de uma pandemia que perdura até os dias de hoje, mesmo que com menos intensidade, já é perceptível que trabalhos e estudos no modo remoto aumentaram para que a população pudesse, de perto modo, se proteger contra o vírus da COVID-19. Contudo, o investimento em móveis relacionados às áreas de trabalho não é o bastante para que a produtividade também aumente. O conhecimento e devido cuidado em relação a como se portar na hora do trabalho/estudo remoto é um fator chave para que os usuários não desenvolvam futuramente uma doença que possa atrapalhar o seu bem estar. Apesar de já existirem muitos softwares relacionados à ergonomia, muitos estão incompletos, abrangendo apenas algumas áreas físicas que podem ser afetadas e outros, além disso, ainda não são aplicativos gratuitos. Reunindo diversas funcionalidades como recomendar alongamentos para que o usuário possa fazer nas suas pausas, reunir informações sobre ergonomia para informar os usuários sobre o que é ergonomia e demais detalhes, função pomodoro que visa fazer ciclos de trabalho e alertar quando será as pausas e demais funcionalidades formam o objetivo desse software que é auxiliar os usuários, de forma gratuita, a cuidarem do corpo e aumentarem a produtividade de forma adequada para que possam dedicar-se aos seus objetivos e deveres de forma mais saudável, mirando em pessoas que trabalham de modo remoto e qualquer usuário que utiliza um desktop ou notebook para realizar seu trabalho.",
        "abstract": "",
        "link_acesso": "https://bdtcbra.omeka.net/items/show/671",
        "arquivo_pdf": "",
        "tipo_trabalho": "TCC"
    },
    {
        "titulo": "Desenvolvimento de um portal de egresso para o Instituto Federal de Brasília",
        "autor": "Santos, André Luiz Gomes dos",
        "orientador": "Barros, Heitor José Dos Santos (Orient.)",
        "coorientador": "",
        "ano": "2022",
        "curso": "Tecnologia em Sistemas para Internet",
        "instituicao": "Instituto Federal de Brasília - Campus Brasília",
        "palavras_chave": "Sistema; Egresso; Portal; IFB",
        "resumo": "O presente trabalho tem por objetivo facilitar a comunicação entre o IFB e os seus ex alunos, através de um sistema de portal de egresso, atendendo alguns pontos da Política de Acompanhamento de Egressos. Inicialmente o sistema vai armazenar, centralizar e compartilhar informações relevantes sobre os egressos. Esses dados são importantes para mostrar a perspectiva dos egressos sobre os cursos do IFB e qual a sua colocação no mercado de trabalho pós IFB. Atualmente o instituto federal não tem uma área dedicada a essa importante demanda, que tem potencial de ajudar na melhoria dos cursos através do feedback dos egressos, podendo ajudar também os futuros alunos do IFB, pois através do portal de egresso eles poderão ver se o curso pretendido oferece uma rápida colocação no mercado de trabalho, se os alunos estão gostando do curso e se precisa fazer algum curso extra.",
        "abstract": "",
        "link_acesso": "https://bdtcbra.omeka.net/items/show/804",
        "arquivo_pdf": "",
        "tipo_trabalho": "TCC"
    },
    {
        "titulo": "LOGEX (logEx) : um auxílio para a resolução de problemas matemáticos envolvendo funções logarítmicas e exponenciais",
        "autor": "Oliveira, Mônica de",
        "orientador": "Bonfim, Cristiane Jorge de Lima (Orient.)",
        "coorientador": "",
        "ano": "2021",
        "curso": "Tecnologia em Sistemas para Internet",
        "instituicao": "Instituto Federal de Brasília - Campus Brasília",
        "palavras_chave": "Ensino de matemática; Ensino remoto; Funções logarítmicas e exponenciais; Design Based Research; Design Sprint; Engenharia de software",
        "resumo": "Resolver problemas matemáticos envolve metodologias apropriadas para a construção de uma solução. Entender o problema, traçar um plano, executá-lo e revisar a solução são etapas geralmente utilizadas pelos educadores desta e de outras áreas para solucionar problemas. O ensino de funções exponenciais e logarítmicas perpassa a interpretação de uma situação problema. Neste trabalho, buscamos auxiliar o profissional da educação a encontrar uma abordagem tecnológica para uma demanda que tem sua maior eficácia sob tutoria: a interpretação do enunciado de uma questão matemática. Para isso, propomos o desenvolvimento de uma plataforma web que auxilie o processo de interpretação de problemas matemáticos e contribua com os processos de ensino aprendizagem das funções logarítmicas e exponenciais. O desenvolvimento utilizou as etapas de engenharia de software e em cada etapa houve a participação das professoras especialistas no ensino de matemática no Ensino Médio Integrado em Informática do Instituto Federal - Campus Brasília, possibilitada pela metodologia Design Based Research - BR. Na etapa de levantamento de requisitos, além da participação da professora especialista, foi também utilizada a metodologia de Design Sprint com a participação de estudantes do 2o ano do Ensino Médio Integrado em informática que já haviam, à época, estudado em sala de aula, o conteúdo de funções logarítmicas e exponenciais, foco da plataforma web. A solução proposta, logEx, foi desenvolvida centrada nos usuários e está disponível na web com perfil de estudante e educador. Nela, o professor tem a liberdade de inserir uma situação problema e tantas perguntas quantas julgar necessárias dentro da metodologia escolhida para levar o aluno à construção do resultado. A avaliação da experiência do usuário por parte dos estudantes mostra uma boa aceitação. Na avaliação das duas professoras especialistas e demandantes da plataforma, a logEx será utilizada em sala de aula como apoio ao ensino de funções logarítmicas e exponenciais, uma vez que a questão pode ser inserida e personalizada pelo professor conforme o perfil dos estudantes.",
        "abstract": "",
        "link_acesso": "https://bdtcbra.omeka.net/items/show/450",
        "arquivo_pdf": "",
        "tipo_trabalho": "TCC"
    },
    {
        "titulo": "Sistema de aproveitamento de estudos do Instituto Federal de Brasília: Campus Brasília",
        "autor": "Dantas, Hellyson Macedo",
        "orientador": "Van der Linden, Marx Gomes (Orient.)",
        "coorientador": "",
        "ano": "2020",
        "curso": "Tecnologia em Sistemas para Internet",
        "instituicao": "Instituto Federal de Brasília - Campus Brasília",
        "palavras_chave": "Sistema web; Aproveitamento de estudos; Rede federal de ensino",
        "resumo": "O presente trabalho busca apresentar a proposta de desenvolvimento de um software web para a automatização do processo de aproveitamento de estudos do Instituto Federal de Brasília — Campus Brasília —, a maneira atual do processo de solicitação de aproveitamento, que ocorre no campus, é feita de maneira manual por meio de formulários em papel e requisita a necessidade do aluno, professor e servidor atuarem de maneira presencial para que o processo ocorra e quando não é dessa maneira devido a situações excepcionais, é por meio de formulários eletrônicos não modularizados. A maneira mecânica como esse processo é feita atrasa consideravelmente todas as solicitações e gera enormes quantidades de papel e documentos. Esse trabalho busca suprir essa demanda por meio de um software capaz de simplificar o processo, funcionando online e sem a necessidade do aluno deslocar-se pessoalmente ao campus ou necessitar que o professor ou servidor estejam presencialmente no campus para avaliar solicitações de aproveitamento de estudo. A metodologia utilizada para a composição desse trabalho foi a pesquisa exploratória, e o resultado foi um software web em fase de teste.",
        "abstract": "",
        "link_acesso": "https://bdtcbra.omeka.net/items/show/303",
        "arquivo_pdf": "",
        "tipo_trabalho": "TCC"
    },
    {
        "titulo": "123 Ajuda: um chatbot como caminho para rede de apoio psicológico",
        "autor": "Corrêa, Laís Alves; Santos, Anelise Costa dos",
        "orientador": "Oliveira, Fábio Henrique Monteiro (Orient.)",
        "coorientador": "",
        "ano": "2023",
        "curso": "Tecnologia em Sistemas para Internet",
        "instituicao": "Instituto Federal de Brasília - Campus Brasília",
        "palavras_chave": "Chatbots; Suporte psicológico; Saúde mental; Inteligência artificial; Processamento de linguagem natural",
        "resumo": "Diante do impacto da pandemia de COVID-19 na saúde mental, o projeto 123 Ajuda propõe um chatbot para suporte em saúde mental. Desenvolvido com a colaboração de um especialista em terapia comportamental, utiliza tecnologia de Natural Language Understanding (NLU) para encaminhar para centros de apoio psicossocial do Distrito Federal. Testes revelaram sua eficácia em atender às necessidades de saúde mental, sendo uma solução viável para o encaminhamento ao suporte à saúde mental pós-pandemia. O objetivo foi desenvolver um chatbot informativo para encaminhar profissionais essenciais da pandemia de COVID-19 para canais de ajuda de saúde mental. A validação do fluxo de conversação foi garantida por uma profissional de psicologia, assegurando uma linguagem empática. O desenvolvimento com Rasa Open Source enfrentou desafios técnicos, mas alcançou sucesso, destacando a importância do desenvolvimento contínuo para criar soluções eficazes.",
        "abstract": "",
        "link_acesso": "https://bdtcbra.omeka.net/items/show/1056",
        "arquivo_pdf": "",
        "tipo_trabalho": "TCC"
    },
    {
        "titulo": "Palavrinhas do folclore: um objeto de aprendizagem para crianças em fase de alfabetização",
        "autor": "Formiga, Vanessa de Andrade",
        "orientador": "Mombach, Jaline Gonçalves (Orient.)",
        "coorientador": "",
        "ano": "2020",
        "curso": "Tecnologia em Sistemas para Internet",
        "instituicao": "Instituto Federal de Brasília - Campus Brasília",
        "palavras_chave": "Objeto de aprendizagem; Alfabetização infantil; Folclore",
        "resumo": "O folclore precisa ser trabalhado nas escolas. Entretanto, ha poucos recursos tecnologicos de educação para esse tema. Além disso, há demanda por objetos de aprendizagem de alfabetização para crianças. Assim, este artigo propoe o desenvolvimento de um objeto de aprendizagem para a alfabetização que explora o tema folclórico. O recurso chamado “Palavrinhas do Folclore” tem o objetivo de explorar o Folclore e a hipotese de escrita infantil. As etapas de desenvolvimento incluem revisao de literatura, estudos de ferramentas e metodos, e prototipagem. Os resultados obtidos após validação mostraram que a ferramenta pode auxiliar os professores na alfabetização e na exploração do tema Folclore com crianças.",
        "abstract": "",
        "link_acesso": "https://bdtcbra.omeka.net/items/show/301",
        "arquivo_pdf": "",
        "tipo_trabalho": "TCC"
    },
    {
        "titulo": "GLibras: sistema web gamificado para o ensino de libras",
        "autor": "Ventura, Luiz Henrique de Paiva; Pereira, Mikaela Brito",
        "orientador": "Santos, Sylvana Karla da Silva de Lemos (Orient.); Mendes, Núbia Flávia Oliveira (Coorient.)",
        "coorientador": "",
        "ano": "2021",
        "curso": "Tecnologia em Sistemas para Internet",
        "instituicao": "Instituto Federal de Brasília - Campus Brasília",
        "palavras_chave": "Libras; Aprendizagem; Gamificação; Sistema web",
        "resumo": "O ensino e aprendizagem de Libras requer motivação para despertar interesse no aluno. Os métodos tradicionais de aprendizado não parecem suficientes para tal engajamento e, por isso, os jogos são relevantes estratégias de ensino. Nesse contexto, os jogos didáticos ganham força como instrumento pedagógico para estimular o interesse e a motivação do aluno. Utilizando as novas tecnologias, este trabalho propôs e avaliou a criação de um sistema web gamificado para o ensino de Libras no qual o aluno realiza o cadastro e participa das atividades, em forma de quiz. O objetivo é que os usuários possam aprender o básico da Libras em forma de jogo, de maneira que o aprendizado possa ser facilitado pela abordagem lúdica dos conhecimentos. Foi desenvolvido um protótipo do sistema, no qual foram realizados testes com participantes voluntários. Foi utilizada abordagem qualitativa e descritiva por meio de um protótipo e um questionário para a coleta de dados. Foi realizado um levantamento de literatura a partir de uma revisão bibliográfica, em textos da legislação e em artigos científicos e com base em pesquisas externas. As fontes referenciadas serviram de embasamento para o desenvolvimento do que será proposto.",
        "abstract": "",
        "link_acesso": "https://bdtcbra.omeka.net/items/show/539",
        "arquivo_pdf": "",
        "tipo_trabalho": "TCC"
    },
    {
        "titulo": "A descentralização de dados com Blockchain",
        "autor": "Souza, Vinícius Fernando de Oliveira",
        "orientador": "Daoud, Caio Moura (Orient.); Cesar, Hugo Do Carmo Mendes (Coorient.)",
        "coorientador": "",
        "ano": "2019",
        "curso": "Tecnologia em Sistemas para Internet",
        "instituicao": "Instituto Federal de Brasília - Campus Brasília",
        "palavras_chave": "Blockchain; Sistema financeiro; Bancos",
        "resumo": "O avanço da tecnologia, nos últimos anos, proporcionou diversas mudanças e adaptações na população. Entre essas inovações, a utilização de meios eletrônicos para armazenar e transferir bens financeiros, como transferência on-line e caixas eletrônicos, aliados aos seus intermediadores, os bancos. Porém, após a familiarização das pessoas com essas ferramentas, notou-se que a tecnologia usada para armazenar, transferir e intermediar essas operações, tornou-se ultrapassada. Nesse sentido, este trabalho consiste em estudar este tipo de sistema utilizado pelo sistema financeiro atual e, com isso realizar uma pesquisa sobre os benefícios de utilizar uma nova tecnologia para proporcionar uma inovação em compartilhamento de informações bancárias, chamada Blockchain. A ferramenta Blockchain foi desenvolvida principalmente para proporcionar uma maior segurança, agilidade e redução de tempo nas operações financeiras de bitcoins, uma moeda virtual. Porém, esse sistema permite novas variedades de utilização, como a integração dessa tecnologia aos sistemas de bancos.",
        "abstract": "",
        "link_acesso": "https://bdtcbra.omeka.net/items/show/28",
        "arquivo_pdf": "",
        "tipo_trabalho": "TCC"
    },
    {
        "titulo": "Uso de provas de conhecimento nulo na segurança de blockchains",
        "autor": "Dias, Vinícius dos Santos Evangelista",
        "orientador": "Mendes Cesar, Hugo do Carmo (Orient.)",
        "coorientador": "",
        "ano": "2023",
        "curso": "Tecnologia em Sistemas para Internet",
        "instituicao": "Instituto Federal de Brasília - Campus Brasília",
        "palavras_chave": "Blockchain; Prova de conhecimento nulo; Prova de conhecimento zero; Segurança; Privacidade",
        "resumo": "Este trabalho de conclusão de curso trata-se de uma pesquisa cujo objeto de estudo é a utilização de provas de conhecimento nulo ZKP para aprimorar a segurança de redes Blockchain. Este estudo tem como objetivo geral investigar possíveis usos das provas de conhecimento nulo em Blockchain e as potenciais melhorias na segurança e desempenho desses sistemas associadas a essa utilização. Para tanto, apresentam-se os conceitos e os principais usos das ZKP e do Blockchain; as possibilidades e vantagens que as ZKP podem oferecer a sistemas Blockchain; e analisam-se usos já existentes de ZKP em Blockchain. A fim de responder a esses objetivos a metodologia se constituiu de revisão bibliográfica. Entre as várias possibilidades de aplicação das ZKP, emergiram aquelas ligadas aos campos das criptomoedas, de eleições eletrônicas (e-Voting), de aplicações na área da saúde e da internet das coisas, devido à crescente relevância dessas áreas na contemporaneidade. Os resultados demonstram que os benefícios das ZKP superam em muito suas dificuldades, de modo que elas têm se expandido e diversificado por meio de diversos projetos na atualidade.",
        "abstract": "",
        "link_acesso": "https://bdtcbra.omeka.net/items/show/1000",
        "arquivo_pdf": "",
        "tipo_trabalho": "TCC"
    },
    {
        "titulo": "Save my money: sistema de consulta de preços de produtos em supermercados",
        "autor": "Rodrigues, Hemelly Frank Pereira",
        "orientador": "Van der Linden, Marx Gomes (Orient.)",
        "coorientador": "",
        "ano": "2019",
        "curso": "Tecnologia em Sistemas para Internet",
        "instituicao": "Instituto Federal de Brasília - Campus Brasília",
        "palavras_chave": "Aplicação mobile; Produto; Preço",
        "resumo": "Esse trabalho tem como objetivo o desenvolvimento de uma aplicação mobile, para Android e iOS, para consultar os preços de um produto e o supermercado em que este está disponível, além de montar e gerenciar listas de compras. Para alcançar este objetivo, foram realizadas pesquisas exploratórias para investigar o problema seguido de um estudo de campo feito por meio de pesquisas. Após a análise do problema e dos dados coletados procedeu-se ao desenvolvimento utilizando o framework Ionic e Firebase.",
        "abstract": "",
        "link_acesso": "https://bdtcbra.omeka.net/items/show/26",
        "arquivo_pdf": "",
        "tipo_trabalho": "TCC"
    },
    {
        "titulo": "Portfólio P&I: um portfólio digital de projetos para o Instituto Federal de Brasília",
        "autor": "Oliveira, Gustavo William Pego de",
        "orientador": "Oliveira, Fábio Henrique Monteiro (Orient.)",
        "coorientador": "",
        "ano": "2022",
        "curso": "Tecnologia em Sistemas para Internet",
        "instituicao": "Instituto Federal de Brasília - Campus Brasília",
        "palavras_chave": "Portfólio digital; Projetos institucionais; Desenvolvimento web; Divulgação",
        "resumo": "Diante da necessidade de divulgar suas produções acadêmicas de forma mais eficiente, instituições de ensino estão cada vez mais apostando em plataformas eletrônicas que busquem apresentar tais informações de modo simples, dinâmico e interativo. Atualmente, uma das formas de se fazer essa divulgação é por meio de portfólios digitais institucionais, que atuam como um acervo interativo para as obras da instituição. Nesse cenário, o Instituto Federal de Brasília carece desse recurso, deixando de usufruir dos diversos benefícios provindos do seu uso. Desse modo, o presente trabalho objetiva a construção do Portfólio de Pesquisa e Inovação, um sistema web completo, back-end e front-end, que tem como objetivo servir de portfólio digital para o instituto, catalogando e apresentando seus trabalhos acadêmicos e proporcionando assim um meio exclusivo para essa divulgação.",
        "abstract": "",
        "link_acesso": "https://bdtcbra.omeka.net/items/show/688",
        "arquivo_pdf": "",
        "tipo_trabalho": "TCC"
    },
    {
        "titulo": "EMBRACE : sistema web de gerenciamento alimentar de pacientes internados em UTI",
        "autor": "Barreto, Thaís Carvalho",
        "orientador": "Segato, Tiago Henrique Faccio (Orient.)",
        "coorientador": "",
        "ano": "2023",
        "curso": "Tecnologia em Sistemas para Internet",
        "instituicao": "Instituto Federal de Brasília - Campus Brasília",
        "palavras_chave": "FAST HUG; Unidade de terapia intensiva; Terapia nutricional; Sistemas de informação; Avaliação nutricional",
        "resumo": "O gerenciamento das unidades de terapia intensiva (UTIs) é complexo, uma vez que os pacientes críticos requerem atenção e cuidados contínuos de toda a equipe de saúde ao longo de sua internação, visando um tratamento e recuperação plenos. Métodos de otimização do acompanhamento desses pacientes já foram desenvolvidos, sendo o FAST HUG um dos mais populares e eficazes. No entanto, apesar de haver a possibilidade de um acompanhamento adequado, a coleta de dados ainda é, muitas vezes, realizada manualmente pelos profissionais. Diante disso, o objetivo desta pesquisa é desenvolver um sistema web que auxilie no gerenciamento alimentar de pacientes internados em UTI, visto que, a automatização do controle dos dados do enfermo traz benefícios como a agilidade, algo essencial em ambientes críticos, além da possibilidade de redução de custos hospitalares e de desperdícios de materiais. Após os estudos necessários para a viabilização do projeto através da modelagem e prototipagem do sistema, o sistema apresenta resultados favoráveis às problemáticas levantadas no gerenciamento alimentar de pacientes críticos, validados pelo demandante do projeto, o Dr. Sérgio Fernandes.",
        "abstract": "",
        "link_acesso": "https://bdtcbra.omeka.net/items/show/995",
        "arquivo_pdf": "",
        "tipo_trabalho": "TCC"
    },
    {
        "titulo": "Gamificação para o aprendizado de obras literárias",
        "autor": "Conceição, Isaac da Rocha da; Torres, Anderson Tosca",
        "orientador": "Deus, Gustavo Henrique Dornelas de (Orient.)",
        "coorientador": "",
        "ano": "2022",
        "curso": "Tecnologia em Sistemas para Internet",
        "instituicao": "Instituto Federal de Brasília - Campus Brasília",
        "palavras_chave": "Gamificação; Ensino-aprendizagem; Obras literárias",
        "resumo": "A gamificação compreende a utilização de ferramentas configuradas no formato de jogos, por meio de novas tecnologias com diferentes contextos. Este trabalho consiste no projeto de desenvolvimento de um jogo, que pode ser utilizado no contexto de gamificação dentro das salas de aula. Com as inovações tecnológicas ocupando cada vez mais espaço dentro das propostas de ensino, visando a construção de uma ferramenta de aprendizagem com foco no estudo de obras literárias. Em um cenário educacional são encontradas diversas formas de práticas de gamificação, com a intenção de ajudar a compreensão e possibilitar melhorias favorecendo a aprendizagem. Na metodologia do trabalho, tratamos do Design Based Research (DBR), como parte do processo para produção de inovações educacionais que trata das implementações dentro do contexto escolar, sendo uma metodologia, que organiza e transforma de forma coerente, a inovação curricular pedagógica. Dentro do planejamento da proposta, foi elaborado o cronograma que se divide em 04 (quatro) fases de um clico de vida de desenvolvimento de software, baseado no Rational Unified Process (RUP), que finaliza com a disponibilização do sistema, identificados e analisados os requisitos de usuário e funcionais. Através da Application Programming Interface (API) com o NodeJS e suas funções responsáveis pelo tempo de execução e o JavaScript, disponibilizarão os dados provenientes de um Sistema de Gerenciamento de Banco de Dados (SGBD) relacional PostgreSQL. Com este software finalizado e disponibilizado aos usuários estudantes do Instituto Federal de Brasília (IFB), este contribui à pessoas interessadas em obras literárias, a participarem de um jogo de perguntas e respostas sobre a referida temática em que, promovendo o envolvimento dos usuários por meio de recompensas usando de mecanismos de pontuação e emblemas.",
        "abstract": "",
        "link_acesso": "https://bdtcbra.omeka.net/items/show/776",
        "arquivo_pdf": "",
        "tipo_trabalho": "TCC"
    },
    {
        "titulo": "Sistema de auxílio e suporte à decisão para investidores iniciantes",
        "autor": "Aguiar, Kennedy Viana Aguiar; Souza, Leandro Campos",
        "orientador": "Queiroz, Diego Cesar Florencio de (Orient.); Cesar, Hugo do Carmo Mendes (Coorient.)",
        "coorientador": "",
        "ano": "2021",
        "curso": "Tecnologia em Sistemas para Internet",
        "instituicao": "Instituto Federal de Brasília - Campus Brasília",
        "palavras_chave": "Bolsa de valores; Investimentos; Programação; Sistema web",
        "resumo": "Diante de toda a inovação tecnológica da atualidade e do surgimento da grande variedade de ferramentas e soluções para problemas cotidianos, muitas áreas de conhecimento são beneficiadas direta e indiretamente pela tecnologia, dentre elas, a área econômica. Atualmente, é possível consultar saldos e extratos de conta bancária, realizar transferências e pagamentos com apenas um dispositivo móvel com acesso à internet. Há, ainda, a possibilidade de negociar ativos financeiros, comprar e vender ações e realizar operações na Bolsa de Valores; muitas pessoas estão recorrendo a este tipo de serviço pela praticidade e vêem nisso a possibilidade de incrementar suas rendas com os lucros obtidos. Entretanto, apesar da facilidade de acesso a tais serviços, investir e fazer aplicações são atividades bastante arriscadas, ademais, requerem um certo nível de conhecimento financeiro por parte do investidor, o que pode, por vezes, ser prejudicial e resultar em uma experiência frustrante, além de comprometer a economia e a estabilidade de quem as pratica com pouca ou nenhuma instrução. Dessa forma, este trabalho propõe o desenvolvimento de um sistema web capaz de auxiliar e guiar os investidores inexperientes, através da implementação de funcionalidades que vão desde a avaliação de ativos até a geração de sugestões de investimentos com base nas preferências do próprio investidor, sem excesso de informação ou gráficos complexos.",
        "abstract": "",
        "link_acesso": "https://bdtcbra.omeka.net/items/show/594",
        "arquivo_pdf": "",
        "tipo_trabalho": "TCC"
    },
    {
        "titulo": "Utilização de sistemas de negociação automatizados na operação de ativos da Bolsa de Valores",
        "autor": "Schlottfeldt Neto, Elizeu Grosskopf",
        "orientador": "Neves, Ana Regia de Mendonça (Orient.)",
        "coorientador": "",
        "ano": "2021",
        "curso": "Tecnologia em Sistemas para Internet",
        "instituicao": "Instituto Federal de Brasília - Campus Brasília",
        "palavras_chave": "Algoritmos de negociação; Negociação de títulos; Bolsa de valores; Metatrader 5 - MT5",
        "resumo": "Este trabalho tem como principal finalidade comparar dois algoritmos de negociação (Experts Advisors), o ”Trade System Larry Williams 9.1” e o ”Modelo Dave Landry”, a fim de descobrir qual possui a melhor estratégia operacional, baseado em lucro e taxa de acerto. Para isso, a fundamentação teórica desta pesquisa aplicada e baseada na metodologia de revisão sistemática da literatura e os robôs de trade para teste foram desenvolvidos na plataforma MetaTrader 5.",
        "abstract": "",
        "link_acesso": "https://bdtcbra.omeka.net/items/show/527",
        "arquivo_pdf": "",
        "tipo_trabalho": "TCC"
    },
    {
        "titulo": "Sistema de gestão de processos administrativos disciplinares",
        "autor": "Maceda, Naionara Ramos de",
        "orientador": "Daoud, Caio Moura (Orient.); Cesar, Hugo do Carmo Mendes (Coorient.)",
        "coorientador": "",
        "ano": "2020",
        "curso": "Tecnologia em Sistemas para Internet",
        "instituicao": "Instituto Federal de Brasília - Campus Brasília",
        "palavras_chave": "Sistema web; Processo administrativo disciplinar; Comissão disciplinar",
        "resumo": "Este trabalho visa apresentar uma solução em forma de sistema web destinada à gestão de Processos Administrativos Disciplinares (PADs) e Sindicâncias na Comissão Disciplinar do Ministério Público Federal (MPF). Através de uma extensa pesquisa acerca do funcionamento do procedimento disciplinar na Administração Pública e em observações in loco, pontuou-se uma certa desorganização no controle de procedimentos disciplinares no referido setor. Assim, foi analisada a possibilidade de criação de um software capaz de sanar algumas das dificuldades enfrentadas. Considerando isso, foi desenvolvida uma aplicação utilizando a linguagem Java juntamente com o framework Spring e com base no padrão MVC. O resultado é um sistema web que permite a centralização de dados dos processos e dos servidores responsáveis, além de possibilitar a estes serem notificados quanto a prazos iminentes de prorrogação e prescrição de processos.",
        "abstract": "",
        "link_acesso": "https://bdtcbra.omeka.net/items/show/304",
        "arquivo_pdf": "",
        "tipo_trabalho": "TCC"
    },
    {
        "titulo": "Desenvolvimento de um sistema de inscrições para o programa de apoio ao desenvolvimento técnico e científico",
        "autor": "Melo, Lucas Hipolito Pessoa de",
        "orientador": "Oliveira, Alex Helder Cordeiro de (Orient.)",
        "coorientador": "",
        "ano": "2021",
        "curso": "Tecnologia em Sistemas para Internet",
        "instituicao": "Instituto Federal de Brasília - Campus Brasília",
        "palavras_chave": "MVP Web; Coordenação Geral de Assistência Estudantil - CGAE; Gerenciamento de inscrições; Autenticação",
        "resumo": "Este trabalho tem como objetivo o desenvolvimento do sistema MVP WEB destinado ao gerenciamento e controle de inscrições para programa de auxílio técnico científico, o sistema oferece o caminho para o aluno obter o auxílio desejado, tendo como o resultado da situação do aluno depois da análise da solicitação de auxílios, entretanto, uma das dificuldades encontradas pelos alunos foram recurso e tempo para imprimir diversos anexos e a servidora do CGAE tendo um gerenciamento e controle complexo por planilhas eletrônicas digitando aluno por aluno. O desenvolvimento do sistema situado visa a entrega de um sistema MVP para economizar tempo, tanto para o aluno quanto para a servidora, obter mais segurança, e para sugestões futuras, evitar ficar transferido planilhas pelo pen drive, evitar inserção de fórmulas complexas na interface para gerar, gráficos, emitir relatórios e checklist completa conforme for acrescentando informações do edital. Os objetivos foram alcançados por meio da entrega de um sistema MVP, pois um sistema final requer muitos recursos, mais do que seria viável para um TCC, resultando em um sistema grande e robusto.",
        "abstract": "",
        "link_acesso": "https://bdtcbra.omeka.net/items/show/566",
        "arquivo_pdf": "",
        "tipo_trabalho": "TCC"
    },
    {
        "titulo": "FABBRINI: sistema para teleconsultas na área da saúde utilizando frameworks javascript",
        "autor": "Shibata, Douglas Seidi",
        "orientador": "Segato, Tiago Henrique Faccio (Orient.)",
        "coorientador": "",
        "ano": "2020",
        "curso": "Tecnologia em Sistemas para Internet",
        "instituicao": "Instituto Federal de Brasília - Campus Brasília",
        "palavras_chave": "Sistema web; Teleconsulta; Saúde; Javascript; Framework",
        "resumo": "A utilização de plataformas na área da saúde para consultas à distância tem se mostrado cada vez mais viável, em virtude da sobrecarga do sistema de saúde, entre outros problemas. Um fator que ressaltou sua importância foi pandemia mundial da COVID-19, que dificultou e em alguns casos até impossibilitou as consultas presenciais. Este trabalho tem como objetivo desenvolver um sistema que auxilie na comunicação entre profissional e paciente, por meio de videochamadas, agendamentos de consultas, prontuário integrado, entre outros recursos que facilite a vida dos envolvidos. Após pesquisas na literatura certificou- se que a tecnologia mais adequada para o desenvolvimento do sistema seria a linguagem javascript e seus frameworks, pois facilitam o uso de recursos como áudio e vídeo na web. O sistema foi testado com profissionais da saúde e seus pacientes para validar sua viabilidade e usabilidade. O resultado foi satisfatório e mostra que a realização de teleconsultas na área da saúde apresentam diversos benefícios, além de possuir potencial para diminuir a sobrecarga nos centros de saúde.",
        "abstract": "",
        "link_acesso": "https://bdtcbra.omeka.net/items/show/305",
        "arquivo_pdf": "",
        "tipo_trabalho": "TCC"
    },
    {
        "titulo": "PA-Star-Web: uma arquitetura em nuvem para obtenção do alinhamento múltiplo ótimo de sequências biológicas",
        "autor": "Oliveira, Eneias Paulo de",
        "orientador": "Lima, Daniel Sundfeld (Orient.)",
        "coorientador": "",
        "ano": "2021",
        "curso": "Tecnologia em Sistemas para Internet",
        "instituicao": "Instituto Federal de Brasília - Campus Brasília",
        "palavras_chave": "Bioinformática; PA-Star; Comparação múltipla de sequências",
        "resumo": "A comparação de sequências é uma das operações mais importantes da Bioinformática. O PA-Star é uma ferramenta proposta recentemente, que obtém o alinhamento ótimo de múltiplas sequências. Para facilitar o acesso ao PA-Star, propomos nesse trabalho uma web-server para disponibilizar o acesso a ferramenta com um simples navegador web. Além disso, vários recursos computacionais podem ser necessários para essa operação, por isso também é proposta uma arquitetura em nuvem, para receber, processar e visualizar os dados.",
        "abstract": "",
        "link_acesso": "https://bdtcbra.omeka.net/items/show/431",
        "arquivo_pdf": "",
        "tipo_trabalho": "TCC"
    },
    {
        "titulo": "Proposta de modelagem de dados de sensores e estudo comparativo de performance aplicado no contexto da saúde",
        "autor": "Candeira, Daniel Barros",
        "orientador": "Oliveira, Fábio Henrique Monteiro (Orient.)",
        "coorientador": "",
        "ano": "2020",
        "curso": "Tecnologia em Sistemas para Internet",
        "instituicao": "Instituto Federal de Brasília - Campus Brasília",
        "palavras_chave": "Sensores; Modelagem de dados; Saúde; Framework Flask; Framework Django",
        "resumo": "A miniaturização de sensores, entre outros aspectos, ocasionou o aumento da demanda por armazenamento e processamento de dados. A abundância de novas tecnologias possibilitou a captura de dados relacionados à saúde de difícil acesso até então. Contudo, há desafios quanto ao desenvolvimento de aplicações habilitadas com esses sensores, haja vista que fornecem dados variados em diferentes formatos, dificultando o processo de padronização e validação. Esse artigo apresenta uma proposta de modelagem de dados de sensores aplicados no contexto da saúde, e um comparativo da performance de leitura e escrita do modelo proposto em APIs desenvolvidas com os frameworks Flask e Django com os bancos de dados MongoDB e PostgreSQL.",
        "abstract": "",
        "link_acesso": "https://bdtcbra.omeka.net/items/show/348",
        "arquivo_pdf": "",
        "tipo_trabalho": "TCC"
    }
]